{"key": "NEFFEX|||Fight Back|||0", "primary_emotion": "Fear", "supporting_emotion": "Sadness", "summary": "The lyrics convey a sense of pessimism and frustration towards people's doubts and opinions. The speaker feels that they won't succeed due to competition and other people's negativity, implying that they are not good enough or different enough from others. This is reinforced by the repetition of 'you're never gonna make it' throughout the song. Furthermore, the lyrics emphasize the importance of ignoring haters and forging one's own path, rather than being swayed by others' opinions and expectations. Overall, the message encourages self-reliance and resilience in the face of adversity."}
{"key": "NEFFEX|||Rumors|||1", "primary_emotion": "Desire", "supporting_emotion": "Fear", "summary": "The lyrics describe a person's obsession with someone who is rumored to have a fantastic body. The narrator wants to see it for themselves and is drawn in by the rumors. They're aware of the whispers saying this person has a reputation for being complicated, but that only makes them more fixated."}
{"key": "NEFFEX|||Grateful|||2", "primary_emotion": "Confidence", "supporting_emotion": "Hope", "summary": "The lyrics describe the artist's determination and resilience in pursuing their passions and goals. They emphasize the importance of staying focused, being genuine, and overcoming obstacles. The song seems to be about empowerment and self-belief, encouraging listeners to work hard and stay motivated. This relentless pursuit of success is evident throughout the track, with the artist expressing a desire to rise above the noise and achieve their desired outcome. The lyrics also touch on feelings of loneliness but emphasize that the end goal is worth it."}
{"key": "NEFFEX|||Destiny|||3", "primary_emotion": "Desire", "supporting_emotion": "Confidence", "summary": "This song is about the struggle to achieve success and prove oneself despite obstacles and negativity. The lyrics convey a strong sense of determination and perseverance, with the artist refusing to give up on their goals. They've been through personal struggles and setbacks, but they're driven by a desire to succeed and make a name for themselves. The poem explores themes of resilience, motivation, and overcoming adversity."}
{"key": "NEFFEX|||Best of Me|||4", "primary_emotion": "Confidence", "supporting_emotion": "Hope", "summary": "The lyrics describe the powerful message of believing in oneself and making one's own luck. The speaker emphasizes the importance of hard work, determination, and staying focused on achieving their goals. They acknowledge mistakes as opportunities for growth and push themselves to reach new heights. The overall tone is optimistic and inspiring."}
{"key": "NEFFEX|||Cold|||5", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The lyrics describe a sense of loneliness and isolation. The speaker feels alone and unsure of themselves, often feeling like they're at risk of breaking down or losing control. They struggle to understand themselves and navigate their emotions, but they refuse to give up and instead choose to take pride in their own decisions and identity."}
{"key": "NEFFEX|||Failure|||6", "primary_emotion": "Hope", "supporting_emotion": "Ambition", "summary": "The song is about persevering and staying focused on achieving one's goals. The lyrics convey a sense of determination, work ethic, and fearlessness in pursuing one's dreams. The speaker emphasizes the importance of not giving up and continues to push forward despite obstacles. The song seems to be an anthem for those who feel trapped or uncertain about their path in life."}
{"key": "NEFFEX|||Life|||7", "primary_emotion": "Nostalgia", "supporting_emotion": "Desire", "summary": "The lyrics describe the struggle for success and the desire to prove oneself. The speaker is driven by a thirst for recognition and willing to work hard to achieve their goals. They are confident in their abilities and refuse to settle for being overlooked or undervalued. The song's message is one of ambition, perseverance, and the importance of believing in oneself."}
{"key": "NEFFEX|||Never Give Up|||8", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "A meaningful melody that embodies our understanding and connection with the world around us. Through lyrics, we can uncover profound insights about love, loss, struggle, resilience, and redemption.\nWithin these lines, we'll find solace in shared experiences,\nexplore new meanings, and discover how our struggles\nare universally understood by fellow human beings."}
{"key": "NEFFEX|||Crown|||9", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "The lyrics convey a sense of hope and nostalgia as the speaker reflects on a past experience with a loved one. The song's message is about cherishing memories and learning to move forward from difficult periods. However, there is also a tinge of sadness and longing for what could have been."}
{"key": "NEFFEX|||Chance|||10", "primary_emotion": "Sadness", "supporting_emotion": "Gratitude", "summary": "The song is about a person's reflection on the end of a relationship. It describes their memories and feelings about what they had with that person.\nThe lyrics show how this experience has helped them grow as a person, and they've learned to appreciate themselves more.\nIt's a heartfelt and introspective song, using phrases like 'I'm standing still' and 'Lost without you' to convey the emotional pain of losing someone close.\nDespite the sadness, there's a sense of acceptance and gratitude for having experienced that love.\nThe song is an ode to self-awareness and the bittersweet memories of what could have been."}
{"key": "NEFFEX|||Careless|||11", "primary_emotion": "Desire", "supporting_emotion": "Sadness", "summary": "Summarizing the lyrics of the song, it is a reflection on the pain of unrequited love, with feelings of sadness and longing for something that can never be. The emotional tone suggests a deep sense of melancholy and wistfulness, as the speaker yearns for a connection that seems destined to remain out of reach."}
{"key": "NEFFEX|||Things Are Gonna Get Better|||12", "primary_emotion": "Regret", "supporting_emotion": "Hope", "summary": "As the sun sets on another long day, we can't help but feel a sense of regret for all the opportunities we let slip away. We thought we had enough time to make things right, but it seems that some wounds never truly heal. The pain and longing lingers, reminding us of what could've been if only we had taken the leap. Yet, even in the depths of despair, we find a glimmer of hope that maybe tomorrow will be different. Maybe we'll have another chance to make things right."}
{"key": "NEFFEX|||Soldier|||13", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "Music is a powerful medium that has the ability to bring people together, transcend cultural boundaries, and evoke strong emotions. This song is a beautiful example of how music can be used to express feelings of hope and joy. The lyrics speak about wanting to be free and spread love, reminding us all that even in difficult times we have the power to make a difference. It encourages us to use our talents to create something positive, which resonates deeply with me. I believe this song has the potential to inspire others and bring people closer together through its uplifting message. The emotions conveyed are primarily filled with hope and joy, as well as a sense of longing for freedom."}
{"key": "NEFFEX|||Numb|||14", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "As the lyrics unfold, they take us on a journey of self-discovery, where Being true to oneself and embracing one's unique qualities are celebrated. The song whispers words of encouragement, urging listeners to break free from societal expectations and be unapologetically themselves. With a message that resonates deeply with our inner struggles, this anthem serves as a powerful reminder of the importance of individuality. Love and Nostalgia fill the air, evoking feelings of warmth and comfort. The song's emotional depth leaves listeners craving more."}
{"key": "NEFFEX|||Nightmare|||15", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "In this meaningful and sentimental ballad, the lyrics delve into the bittersweet feelings of reminiscing about cherished moments and experiences from the past. The narrative is woven together with vivid storytelling that evokes strong emotions and creates a deep sense of nostalgia. As the singer reflects on the fleeting nature of life, the song takes a poignant turn, highlighting the importance of holding onto memories and learning to let go of what once was.\n\nThe emotional themes explored in this piece are centered around the human experience of grappling with bittersweet emotions and coping with the passage of time. The overall tone is introspective, wistful, and ultimately hopeful, leaving listeners with a sense of perspective and gratitude.\n\nThrough the lyrics, we see the narrator struggling to reconcile their current reality with the cherished memories of the past. This conflict yields powerful insights into the human experience, and the song's message encourages listeners to cherish what they have while still finding ways to move forward."}
{"key": "NEFFEX|||Greatest|||16", "primary_emotion": "Hope", "supporting_emotion": "Desire", "summary": "The lyrics of this song aptly capture the struggles and triumphs of life. The opening lines 'I was chasing the sun, trying to catch up with me' poignantly convey the feeling of being lost and disconnected from oneself. As the song progresses, it becomes evident that the artist is grappling with identity, belonging, and the big challenges that come with growing up. The chorus, 'What am I doing here? How did I get so far?' echoes this sentiment, highlighting the uncertainty and self-doubt that can arise during periods of transition. Throughout the song, the emotional themes of hope, longing, and redemption are woven together, offering a message of resilience and perseverance."}
{"key": "NEFFEX|||Watch Me|||17", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The song conveys a sense of nostalgia and longing as it describes the pain of remembering past loves. The lyrics paint vivid pictures of memories shared with these people, from watching sunsets together to dancing in the rain. In this context, emotions such as 'Nostalgia' and 'Sadness' are observed due to the bittersweet memory recall."}
{"key": "NEFFEX|||New Beginnings|||18", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics seem to be conveying the message of building resilience and perseverance in the face of adversity. The speaker is sharing their experiences and emotions after facing a string of rejections, but they are determined to keep moving forward. This can be seen as a call to the listeners to find the strength within themselves to overcome similar challenges."}
{"key": "NEFFEX|||Dangerous|||19", "primary_emotion": "Joy", "supporting_emotion": "Peace", "summary": "The lyrics of this song convey a powerful message of acceptance and the importance of embracing one's true self. The speaker describes feeling overwhelmed by societal expectations and pressure to conform, ultimately, acceptance. This realization brings relief and peace, suggesting that surrendering to oneself can be liberating. Throughout the song, the emotions expressed are primarily Joyful and Peaceful, as the speaker finds solace in their authentic selves. The lyrics also touch on themes of Love and Hope, hinting at a desire for fulfillment and happiness."}
{"key": "NEFFEX|||One Shot|||20", "primary_emotion": "Hope", "supporting_emotion": "Gratitude", "summary": "The lyrics convey a mix of emotions and ideas as the speaker reflects on their relationship with someone they deeply care about. They express gratitude for the time spent together, despite the imperfections and challenges faced along the way. The poem also touches on feelings of loneliness and longing, but ultimately conveys a sense of hope and optimism towards the future. Through their words, the speaker shows appreciation for the growth and understanding that has developed throughout their interaction, acknowledging the effort to maintain connection and build trust. In the end, the tone is introspective and contemplative."}
{"key": "NEFFEX|||Graveyard|||21", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "In this song, the artist reflects on a past relationship, describing it as being full of life and beauty. The lyrics convey a sense of nostalgia and longing for what is now lost. The artist also expresses uncertainty about whether the loved one still thinks of them and if there's any hope for rekindling their connection. Key themes are reminiscence, love, and yearning."}
{"key": "NEFFEX|||Pro|||22", "primary_emotion": "Regret", "supporting_emotion": "Excitement", "summary": "The lyrics of 'Stairway to Heaven' by Led Zeppelin describe a journey through life and the afterlife. The song starts with a haunting guitar riff, setting the tone for the exploration of the supernatural and the unknown. The lyrics delve into themes of mortality, regret, and the fleeting nature of life. Throughout the song, the narrator grapples with the idea that death can be both beautiful and terrifying. One of the most iconic album closers 'Stairway to Heaven' is an ode to self-discovery and introspection as the narrator questions whether he is indeed ready to meet his maker The songs ending is a nod to life's preciousness and the importance of embracing the present moment"}
{"key": "NEFFEX|||Hope|||23", "primary_emotion": "Nostalgia", "supporting_emotion": "Freedom", "summary": "This song's lyrics talk about the joys of nostalgia as it reminisces about memories from the past, emphasizing the importance of appreciating what you have before it's too late. The overall tone is reflective and optimistic, conveying a sense of freedom that comes with embracing the present moment. Additionally, the lyrics hint at the desire to hold onto these memories, acknowledging the impermanence of life. Ultimately, the song celebrates the beauty of nostalgia as a means to cherish the past."}
{"key": "NEFFEX|||Myself|||24", "primary_emotion": "Joy", "supporting_emotion": "Nostalgia", "summary": "This song is about overcoming challenges and embracing your true potential. The lyrics describe a journey of self-discovery, where the speaker learns to let go of their fears and doubts. Joy and Nostalgia are the top two emotions expressed in the lyrics, as the speaker reflects on the past and looks forward to a brighter future."}
{"key": "NEFFEX|||Backstage|||25", "primary_emotion": "Joy", "supporting_emotion": "Peace", "summary": "The lyrics talk about love and acceptance towards this person with the intention of growing together and being on the same page.\nThe narrator is expressing their deep longing for a connection that transcends the ordinary, seeking something extraordinary in this relationship.\nThis song is about recognizing and accepting someone as they are, without trying to change them. "}
{"key": "NEFFEX|||Play|||26", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The lyrics describe a journey of self-discovery and growth, as the speaker reflects on their past experiences and relationships. They share stories of lost love, missed opportunities, and the lessons learned along the way. The song's core emotional themes are Nostalgia and Sadness, as the speaker grapples with regret for things that could have been different. Ultimately, the lyrics express a desire to move forward, embracing the present moment and the chance to learn from past mistakes."}
{"key": "NEFFEX|||Flirt|||27", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The song is an emotional reflection of how loneliness can lead to feelings of sadness and regret. It describes the pain of lost relationships and the struggle to move on. The lyrics convey a sense of longing for connection and understanding. Ultimately, the song is about finding solace in shared experiences and the hope for a brighter future. Top two emotions: ['Sadness', 'Regret']."}
{"key": "NEFFEX|||All These Thoughts|||28", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song is about two people who have been in a loving relationship for many years and are now facing the bitter reality that their love has changed and they have grown apart. The lyrics describe a passionless marriage where the couple tries to keep the flame alive but ultimately realize it's time to move on. Key messages of hope, acceptance, and gratitude can be seen throughout the song as the couple finds closure by acknowledging the good times they shared together."}
{"key": "NEFFEX|||Without You|||29", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The lyrics convey a significant amount of longing and nostalgia as the speaker reflects on a past love that has lost its spark. The narrative unfolds through poetic metaphors, vivid imagery, and sentimental passages, capturing the emotional rollercoaster that follows the demise of a relationship. As the speaker acknowledges the inevitable end, they struggle to come to terms with what could have been. A bittersweet tone pervades the lyrics, highlighting the lingering sense of grief and regret that accompanies the memory of love gone wrong."}
{"key": "NEFFEX|||No Sleep|||30", "primary_emotion": "Desire", "supporting_emotion": "Gratitude", "summary": "A song about chasing one's dreams and aspirations without being held back by negative influences or infringing upon the copyrights of others. The emotional journey follows a path of desire, hope, and ultimately, gratitude as the protagonist forges their own identity and sense of self-worth. \nIn the end, the lyrics emphasize the importance of embracing freedom to create one's own future without compromises."}
{"key": "NEFFEX|||Savage|||31", "primary_emotion": "Hope", "supporting_emotion": "Regret", "summary": "These lyrics capture the longing for freedom and the desire to break free from societal expectations. Freedom is a recurring theme in these lyrics, with the speaker expressing hope for a chance to live life on their own terms and find true happiness without being tied down by external pressures. Nostalgia also plays a role, as the speaker reminisces about past experiences that shaped them into the person they are today. The ultimate message is one of hope and perseverance, urging listeners to hold onto those feelings and keep striving for their goals."}
{"key": "NEFFEX|||Make It|||32", "primary_emotion": "Peace", "supporting_emotion": "Hope", "summary": "The lyrics convey resilience in the face of adversity, as the singer recounts experiences that have caused them to question their capabilities due to self-doubt. The narrative is rich with vivid imagery that highlights the struggle, and the emotions expressed are deeply relatable. Through this story, the listener can gain insight into the importance of perseverance and self-compassion in overcoming obstacles."}
{"key": "NEFFEX|||Primal|||33", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "Life is fragile, and we should cherish every moment. The song talks about the impermanence of life and how it can be taken away at any moment. It encourages us to make the most of the time we have and not take anything for granted. The lyrics also touch on the theme of memory and how our memories define who we are."}
{"key": "NEFFEX|||Light It Up|||34", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "In this song, the narrator's poetic lyrics paint a vivid picture of life experiences that evoke emotions ranging from sadness to elation. With every passing moment, we relive moments of love and loss, bringing tears to our eyes or filling our hearts with joy. The song is an introspective portrayal of emotional highs and lows, as if reading one's own diary, encouraging listeners to explore their deepest thoughts and emotions."}
{"key": "NEFFEX|||Struggle|||35", "primary_emotion": "Joy", "supporting_emotion": "Forgiveness", "summary": "The song vividly describes the importance of embracing our inner selves and accepting who we are, not trying to fit into societal norms. It's a powerful reminder that confidence and freedom come from within and that it's okay to show 'Self-Love' without feeling guilty or ashamed. The lyrics also touch on the themes of hope and forgiveness, emphasizing the need for self-acceptance and authenticity in our lives."}
{"key": "NEFFEX|||Deep Thoughts|||36", "primary_emotion": "Joy", "supporting_emotion": "Freedom", "summary": "The song 'Dancing in the Moonlight' by King Harvest is a classic summer jam that captures the carefree spirit of youth. The lyrics describe a group of friends having a blast at an outdoor party, with laughter, music, and good company filling the night. It's a nostalgic feeling that evokes memories of joy, freedom, and adventure. The song's message is about living in the moment and not worrying about what others think, as long as you're having fun. This carefree attitude is infectious, making this song a timeless favorite among many generations."}
{"key": "NEFFEX|||I’m Not Worth It|||37", "primary_emotion": "Sadness", "supporting_emotion": "Betrayal", "summary": "The song really speaks to me as it captures the moments we let go of our loved ones and how it feels like a parting of souls. The emotions portrayed are deeply human, with feelings of 'Sadness' and 'Betrayal', as if the speaker is holding onto what once was, hoping it wasn't just an illusion. I'm moved by this piece as it takes me on a journey of memories, reliving times that will never be regained."}
{"key": "NEFFEX|||R.I.P.|||38", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "The lyrics describe a journey of self-discovery and reflection, where the narrator is forced to confront their past mistakes and regrets. The narrator expresses feelings of nostalgia and sadness, reminiscing about lost opportunities and failed relationships. Throughout the song, there are also moments of hope and optimism, as the narrator seeks to make amends and learn from their experiences. This emotional rollercoaster is characterized by a mix of melancholic and uplifting emotions."}
{"key": "NEFFEX|||Baller|||39", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "This song is a reflection on nostalgia and longing for a lost love. The lyrics evoke feelings of joy, happiness, sadness, and regret about the choices that were made in the past. The song seems to be about a person who has reached a turning point in their life, wondering what could have been if they had taken a different path."}
{"key": "NEFFEX|||Alive|||40", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song is a heartfelt reflection on the struggles of being in a long-distance relationship. The lyrics poignantly capture the yearning for one's partner, the difficulties of maintaining intimacy and connection across distance, and the resilience of love in the face of adversity. The song's narrator explores themes of nostalgia, longing, and vulnerability as they navigate this challenging situation, ultimately reaffirming their commitment to the relationship and the beloved. "}
{"key": "NEFFEX|||Badass|||41", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song talks about the struggles of growing up and finding one's identity. The lyrics convey a sense of sadness and regret as the singer looks back on past mistakes and lost opportunities. However, there is also a sense of hope and renewal as they look to the future and the possibilities it brings."}
{"key": "NEFFEX|||Sometimes|||42", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song explores the themes of hope, regret, and nostalgia, which are deeply intertwined as the lyrics reminisce about a past love that has vanished like sand between fingers. The passage of time is contrasted with the speaker's failed attempts to move on, leading to feelings of longing and yearning for what could have been. As the song progresses, it becomes clear that the narrator is trapped in a cycle of memories that refuses to fade away."}
{"key": "NEFFEX|||Are You Ok?|||43", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "When the world outside gets cold and dark, we are reminded of the fragility of life and the importance of connection with others. As people come together to share in this time of fear and uncertainty, they find comfort in each other's arms, finding strength in their collective resilience. The song portrays a sense of community, support, and hope as people come together to face challenges. It highlights the power of human connection and how it can help us overcome even the darkest moments. Key messages are about perseverance, unity, and the value of relationships."}
{"key": "NEFFEX|||Lose My Mind|||44", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song is a powerful reflection on the human experience, delving into themes of love, loss, and longing. The lyrics paint a vivid picture of the emotions that come with saying goodbye to someone you love, capturing the bittersweet nature of nostalgia. With a focus on storytelling, the songs use clever metaphors and imagery to convey the complexity of our emotional lives."}
{"key": "NEFFEX|||Unstoppable|||45", "primary_emotion": "Gratitude", "supporting_emotion": "Peace", "summary": "The lyrics convey a sense of nostalgia as the artist reflects on past experiences and memories, describing a series of moments that have shaped their life. The song is an introspective journey through the highs and lows of their younger years, culminating in a sense of appreciation for the present moment. Throughout the lyrics, we see glimpses of joy, love, and heartbreak as the artist grapples with the complexities of growing up. Ultimately, the message is one of gratitude and peace, urging listeners to cherish valuable moments and learn from past experiences."}
{"key": "NEFFEX|||Save Me|||46", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The song describes a person's emotional journey through the different stages of life, with themes of hope and sadness being prominent throughout. The lyrics explore the idea that even in times of sadness, there is always a glimmer of hope to grasp onto. As the story unfolds, the emotions ebb and flow, mirroring the ups and downs of human experience."}
{"key": "NEFFEX|||Self Made|||47", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "Lyrics are about the struggles and sacrifices people make for love. The song highlights the pain and heartache that comes with loving someone. It portrays a situation where one must choose between their own happiness and the well-being of the person they love. This is best demonstrated by a couple who are from different cultural backgrounds, as described in the lyrics 'they tried but it came to an end,' suggesting that their relationship did not succeed possibly due to social barriers.\nThe emotions felt throughout this experience include sadness and regret."}
{"key": "NEFFEX|||Space|||48", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "This song tells the story of someone who is struggling to come to terms with the end of a relationship. The lyrics speak about a lingering sense of sadness and regret, as well as the longing for what could have been. The song's narrative explores themes of love, loss, and heartache, with vivid descriptions of the emotional turmoil that follows a breakup. As the lyrics unfold, it becomes clear that the narrator is grappling with feelings of nostalgia and yearning, as they reminisce about memories shared with their former partner. Throughout the song, there is a sense of introspection and self-reflection, as the narrator works to process their emotions and move forward from the heartbreak."}
{"key": "NEFFEX|||What’s Up|||49", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "The lyrics describe a sense of nostalgia and longing for a past love. The speaker is reflecting on the memories they shared with their former partner, focusing on the positive moments they experienced together. Despite the pain and sadness that comes with heartbreak, the speaker seems to be finding solace in the happy times they had."}
{"key": "NEFFEX|||Blow Up|||50", "primary_emotion": "Sadness", "supporting_emotion": "Anger", "summary": "A song about love and heartbreak as experienced in a once successful romantic relationship that suddenly turns sour through external factors or internal conflicts. The lyrics highlight the pain, sadness, and longing to reclaim what's lost. It also touches on themes of nostalgia and desire to relive past moments with the loved one. Emotions such as regret, fear, and anger are evident throughout the song, emphasizing the struggle to accept the new reality."}
{"key": "NEFFEX|||BITE ME|||51", "primary_emotion": "Hope", "supporting_emotion": "Excitement", "summary": "In this song, the lyrics perfectly capture the journey of overcoming obstacles and finding hope in dark times. The narrative explores the themes of perseverance, self-discovery, and the human capacity to break free from limitations. This uplifting ballad is an anthem for those who have faced adversity yet refuse to give up."}
{"key": "NEFFEX|||We Could Do It All|||52", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "As I walked alone through the city streets, my heart filled with nostalgia for a love that could never be. The memories of our moments together lingered, a bittersweet reminder of what we had, and could have never had again. Despite the tears in my eyes, I knew it was necessary to let go, as the hope of finding another left me with no choice. It is this journey of longing that makes life worth living."}
{"key": "NEFFEX|||Fear|||53", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "Life is a maze we all go through to find out who they truly are. As we navigate through life's twists and turns, we encounter various experiences, people, and situations that shape us into the individuals we become. It's a journey of self-discovery, growth, and evolution, where we learn and adapt to the world around us."}
{"key": "NEFFEX|||Deep in the Game|||54", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "This song is a reflection on the cherished moments with loved ones. It poetically captures the essence of life, emphasizing the importance of embracing the present and letting go of past regrets. The lyrics subtly convey a profound sense of longing and nostalgia for times spent with dear friends and family, highlighting the significance of these relationships in our lives. As we journey through the ups and downs of life, this song serves as a poignant reminder to cherish every moment, whether big or small, with those who bring joy to our hearts."}
{"key": "NEFFEX|||Take Me Away|||55", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "The lyrics of this song are about the emotions that arise when someone is falling in love. The speaker is yearning for a connection with the other person, wanting to be taken away and experience the passion together. In this sense, the song captures the joy and excitement that comes with discovering new feelings."}
{"key": "NEFFEX|||Summertime|||56", "primary_emotion": "Love", "supporting_emotion": "Sadness", "summary": "The song is ultimately a poignant reflection on the complexities of love and relationships, capturing the ups and downs of navigating romance with sensitivity and nuance. It explores themes of vulnerability, trust, and intimacy, with lyrics that are both deeply personal and universally relatable. Through its thoughtful consideration of human emotions and experiences, the song presents a nuanced understanding of what it means to build meaningful connections with others."}
{"key": "NEFFEX|||Coming for You|||57", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "The song is a poetic reflection on the fleeting nature of life. The lyrics touch upon themes of hope, sadness, and nostalgia as the speaker ponders the impermanence of human experiences. Through metaphors and vivid imagery, the songwriter conveys a sense of mortality and the importance of cherishing moments with loved ones."}
{"key": "NEFFEX|||NO TURNING BACK|||58", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "Recalling a past time when life was easy and simple, nostalgia grips the heart as cherished memories flood the mind. The desire to relive those moments is strong, but reality checks in with the harsh realities of today's world. The lyrics delve into themes of longing for a lost era and the search for closure. As one reminisces about moments gone by, it becomes clear that life's fleeting nature is a reality. The longing to recreate these experiences remains, leaving a sense of regret for things left unsaid and undone."}
{"key": "NEFFEX|||Tell Me What You Want|||59", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The song is a nostalgic and emotional journey that delves into the depths of longing for something or someone. The lyrics vividly describe the ache of being apart from what one desires, capturing the pain of separation and the desperation to reconnect. Through this narrative, the song explores themes of love, loss, and the fragility of human connections."}
{"key": "NEFFEX|||Mirror|||60", "primary_emotion": "Nostalgia", "supporting_emotion": "Loneliness", "summary": "This song's lyrics tell the story of an individual who has lost themselves in their own thoughts and memories, struggling to find their place in the world. They reminisce about past relationships and interactions that once filled them with joy but now bring only bittersweet nostalgia. The lyrics capture the emotional turmoil this person experiences as they grapple with feelings of sadness, hopelessness, and regret over what could have been. Amidst the grief and longing, they yearn for a connection, craving human interaction to help ease their loneliness. The emotions conveyed here are a mix of Nostalgia and Loneliness."}
{"key": "NEFFEX|||Gibberish|||61", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "The lyrics of this song speak to the human experience of healing and growth, as individuals navigate through life's challenges. It explores the transformative power of love, self-acceptance, and inner peace as key elements in personal evolution. Through poignant storytelling and vulnerable language, it delves into themes of isolation, emotional vulnerability, and the struggle for connection, all while ultimately finding solace and belonging."}
{"key": "NEFFEX|||Broken Dreams|||62", "primary_emotion": "Nostalgia", "supporting_emotion": "Desire", "summary": "When you can't remember the first time, when it happened, or how it all began... It's like trying to grasp a handful of sand - the harder you try, the more it slips away. Memories fade like the sun setting over a desert horizon. This song captures the longing for something that once was, the desire to hold onto fleeting moments, and the acceptance that time moves forward, leaving us with only nostalgia."}
{"key": "NEFFEX|||Memories|||63", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "The song is a poignant reflection on what could have been if circumstances had played out differently. It explores the theme of missed opportunities and lost connections, painting a vivid picture of the pain and longing that accompany these experiences. The lyrics masterfully convey the ache and regret that come with wondering what might have been, even as they acknowledge the inevitability of change. Ultimately, this song is an invitation to confront the past, let go of regrets, and find solace in the present."}
{"key": "NEFFEX|||When Everything is Gone|||64", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "The song captures the essence of nostalgia, yearning, and hope. The lyrics portray a story of looking back at the past with a feeling of longing to relive it. It conveys a sense of remembering things in a way that makes it hard to forget, and how these memories can be bittersweet. This bittersweet memory is about being young and free, but also vulnerable and uncertain, which is a universal theme for many people."}
{"key": "NEFFEX|||Damn Gurl|||65", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The song is a poignant portrayal of unrequited love, as the speaker's passion and longing are met with indifference and silence from their loved one. The lyrics explore the pain and helplessness that follows this experience, evoking emotions such as sadness and regret. It's a powerful expression of the raw emotional toll taken by unseen or unnoticed love. Despite the heartache, the song ultimately conveys a yearning for connection and human understanding."}
{"key": "NEFFEX|||Lost Not Found|||66", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "A song that captures the poignant moments of people’s lives, it describes how a moment of connection with someone can change everything. The lyrics focus on the beauty of being present and fully engaging in our experiences. It shares vivid descriptions of how the simplest moments can bring immense joy to people's lives. Through the voices of others, we are reminded that life is precious, fleeting, and deeply connected, highlighting the importance of living in the moment."}
{"key": "NEFFEX|||I’ll Be Fine|||67", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song is a heartfelt appeal to find one's purpose and belong in this chaotic world. It talks about feeling lost, searching for answers, and sometimes finding solace in the unknown. The lyrics express the longing for a sense of belonging, the fear of being left behind, and the desire to be understood. Through its poignant narrative, it takes us on a journey through the human experience of self-discovery and growth."}
{"key": "NEFFEX|||As You Fade Away|||68", "primary_emotion": "Sadness", "supporting_emotion": "Freedom", "summary": "This song is about the fading of a relationship and the pain that comes with it.\nThe lyrics speak to the speaker's longing for their partner, but also acknowledge\nthe reality that they are losing them.\nThe emotional rollercoaster in this song\nranges from nostalgia and sadness\nto hopelessness and regret,\nand even the slightest glimmer of freedom.\nThe emotions observed in this song are a mix of sadness and freedom."}
{"key": "NEFFEX|||Spartan|||69", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This iconic song is a powerful ballad that encapsulates the universal human desire for change and growth. It's a poignant exploration of the complexities of life, love, and loss. The lyrics weave together nostalgia, longing, and hope to create a rich tapestry of emotions. The song's themes of perseverance, resilience, and the importance of holding onto hope in the face of adversity are timeless and deeply relatable. ultimately, it's an anthem for anyone who has ever felt stuck and is yearning to break free from the shackles of routine and find their true purpose."}
{"key": "NEFFEX|||GOT THIS|||70", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The song is about the unfulfilled dreams and nostalgia, and longing of someone who has reached a crossroads in life where they are seeking answers from their past and present. They are trying to reconcile their current situation with what they had envisioned for themselves, but reality has not matched up to their expectations. The lyrics convey a sense of disappointment, regret, and introspection as the person tries to make sense of it all."}
{"key": "NEFFEX|||Dance Again|||71", "primary_emotion": "Joy", "supporting_emotion": "Excitement", "summary": "Party Rock Anthem by LMFAO is an energetic and upbeat song that captures feelings of joy, excitement, and freedom. The lyrics describe a sense of liberation and spontaneity as they party and let loose. In this life situation, the speakers are thrilled to be alive and embracing every moment with enthusiasm. Their emotions unfold as Hope, Desire, and Freedom."}
{"key": "NEFFEX|||It’s Just Not Fair|||72", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "This song is a powerful expression of youthful energy and joy. It's a celebration of the carefree days of summer when nothing else matters but having fun. The lyrics vividly capture the excitement and anticipation that comes with entering adulthood. The emotions experienced - love, happiness, desire, freedom, and hope - are palpable as the singer reminisces about past experiences and looks forward to new ones."}
{"key": "NEFFEX|||Pull Me Apart|||73", "primary_emotion": "Hope", "supporting_emotion": "Love", "summary": "This song reminds us to take a step back and realize how we can impact others with our kindness, love, and positivity. It emphasizes the importance of being there for one another, cherishing loved ones, and letting go of ego.\r\n\r\nThe top two emotions observed in this song are both positive: *Hope* - symbolizing a desire to make a difference and bring positivity into people's lives,\r\n*Love* - highlighting the power of love and kindness in bringing us closer together."}
{"key": "NEFFEX|||Closer to Heaven|||74", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "In this song, the artist reflects on their daily routine and the struggles they face in life. They ask themselves what makes them stronger, hinting at the desire to push through difficulties and emerge victorious. The lyrics convey a sense of introspection and self-discovery as the artist searches for answers to these questions. The overall tone is one of resilience and hope, as the artist seeks to find strength within themselves to overcome their challenges."}
{"key": "NEFFEX|||The Show|||75", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The song deeply explores the pain of a broken relationship. It describes the memories shared with the former partner, the nostalgia that lingers, and the longing to go back in time to relive those moments. The lyrics reveal the struggle to forgive and move on, but ultimately convey hope and resilience as the speaker comes to terms with their emotions. Through this personal journey, we are reminded of the importance of emotional intelligence, self-awareness, and self-compassion."}
{"key": "NEFFEX|||Fade Away|||76", "primary_emotion": "Hope", "supporting_emotion": "Gratitude", "summary": "The lyrics speak of hope and gratitude for life, detailing the struggles and triumphs that have shaped the speaker's perspective. They express appreciation for the beauty and complexity of existence, acknowledging the imperfections that make it worthwhile. The song is a heartfelt reflection on the importance of emotional connections and the value of resilience in the face of adversity."}
{"key": "NEFFEX|||Can’t Lose|||77", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "Understanding life situations and experiences is crucial through the lyrics of this song. The artist skillfully conveys the highs and lows of being in a relationship, the emotional rollercoaster one faces when love is present. The song portrays a storage house filled with memories that flood back to those who have shared a life together."}
{"key": "NEFFEX|||Trust Me|||78", "primary_emotion": "Sadness", "supporting_emotion": "Gratitude", "summary": "This song is about the struggles of a person who lost their loved one. It details their journey through grief and the emotional turmoil it brings. They try to cope with their feelings by reflecting on memories and expressing gratitude for the time they had together. Ultimately, it's a heartfelt tribute to the deceased and a reminder to cherish every moment with those we love."}
{"key": "NEFFEX|||Judge|||79", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "This song is about self-discovery and the beauty of finally finding what makes you truly happy. It's a reflection on the journey to get there, filled with emotions such as sadness, joy, and hope. The lyrics portray life situations that we all can relate to, making it a universal message. Despite its ups and downs, the song ultimately leaves the listener feeling more confident and grateful for the experiences they've had."}
{"key": "NEFFEX|||Who The Fuck is NEFFEX!?|||80", "primary_emotion": "Hope", "supporting_emotion": "Fear", "summary": "In this song, the artist shares a heartfelt message about the importance of embracing life and all its experiences. The lyrics capture the emotional highs and lows we encounter, from joy to sadness, and encourage us to find peace in our struggles. Through poetic storytelling, the artist conveys the value of holding on to hope, even when faced with uncertainty and fear."}
{"key": "NEFFEX|||Scars|||81", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "In this powerful ballad, the lyrics convey a sense of hope and joy amidst struggles and trials. The song's narrator recounts their journey through dark times, finding solace in the love and support of others. With each step, they rise above their adversity, celebrating small victories and drawing strength from within. Observed: Joy and Hope."}
{"key": "NEFFEX|||The Itch|||82", "primary_emotion": "Nostalgia", "supporting_emotion": "Confidence", "summary": "Life is full of choices, and sometimes you've got to take a risk to find what truly makes you happy. It's not always easy to recognize the signs and let go of what's holding you back from pursuing your true passion and purpose. Sometimes, you have to make sacrifices for the greater good or for yourself, but with self-awareness and an open mind, you can unlock doors to new horizons. The most important thing is that you are brave enough to look inside and find the truth about who you are, what you want, and what's worth fighting for."}
{"key": "NEFFEX|||Let Me Down|||83", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "This song speaks of the importance of cherishing the time we spend with loved ones and not taking them for granted. It is a poignant reminder of how fleeting life can be, as it tells the story of moments lived with joy, love, and laughter. The memories made are what truly make us feel alive and connected to each other. With every passing year, these moments grow more precious. The song invites listeners to reflect on their own cherished moments and recognize that they too should be celebrated and treasured."}
{"key": "NEFFEX|||With You|||84", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "This song is a masterpiece, it's about overcoming struggles and times when you're feeling lost and uncertain. In this melody, I experience a mix of emotions - first, there's a wave of Joy that crashes over me when memories of the past come flooding back. Then, as the lyrics unfold, Sadness creeps in, like a gentle rain, reminding me of things left unsaid and moments forever gone."}
{"key": "NEFFEX|||Trapped in a Nightmare|||85", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "The song highlights the emotions and struggles that come with loving someone unconditionally. It emphasizes the pain and longing that follows a painful breakup.\nThis heart-wrenching ballad showcases the artist's ability to convey the universal feeling of regret, sorrow, and nostalgia amidst memories of the past relationship.\nAs listeners, we feel empathy for the vocalist as they pour out their heart in these emotional lyrics.\nThe ballad is about the agony and the ache that come with love; it emphasizes that sometimes we must let go and move on from that which could forever change us.\nIn this piece, the artist presents a reflection of human experience,\nand listeners can relate to the emotions conveyed through these heartfelt and poignant lyrics.\n"}
{"key": "NEFFEX|||LIT|||86", "primary_emotion": "Nostalgia", "supporting_emotion": "Gratitude", "summary": "The song is about a person who has gone through several relationships and is now reflecting on the memories they've shared with their exes. They're grateful for the experiences, but also acknowledge that the love was fleeting and nothing to miss. The lyrics convey a sense of wistfulness and nostalgia as they reminisce about the good times and the bad. Ultimately, the song is about learning from past relationships and moving forward."}
{"key": "NEFFEX|||Cold in the Water|||87", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "The song's lyrics describe the experience of chasing your dreams and never giving up. It conveys a sense of perseverance, hope, and resilience in the face of uncertainty. The singer's narrative is woven through vivid descriptions of life situations and emotions, showcasing a range of moments that can be relatable to anyone who has ever pursued their passions. Throughout the lyrics, there's an overwhelming feeling of longing and a strong desire to keep moving forward."}
{"key": "NEFFEX|||BELIEVE|||88", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "A beautiful melody and passionate lyrics make this love song a timeless classic. Joy and sadness are the core emotions expressed, as the singer longs for someone they've lost. The life situation portrayed is one of heartbreak and nostalgia, with the speaker yearning to be reunited with their loved one in afterlife. "}
{"key": "NEFFEX|||A YEAR AGO|||89", "primary_emotion": "Hope", "supporting_emotion": "Regret", "summary": "Recalling and summarizing is a task that requires understanding the content and providing parsed objects in JSON that match the following json_schema:\n\n{\n  \"$defs\": {\n    \"Emotions\": {\n      \"enum\": [\n        \"Joy\",\n        \"Love\",\n        \"Nostalgia\",\n        \"Sadness\",\n        \"Anger\",\n        \"Fear\",\n        \"Hope\",\n        \"Desire\",\n        \"Confidence\",\n        \"Regret\",\n        \"Peace\",\n        \"Excitement\",\n        \"Loneliness\",\n        \"Gratitude\",\n        \"Confusion\",\n        \"Betrayal\",\n        \"Ambition\",\n        \"Forgiveness\",\n        \"Freedom\"\n      ],\n      \"title\": \"Emotions\",\n      \"type\": \"string\"\n    }\n  },\n  \"description\": \"TODO: Schema for Instructor structured LLM output\",\n  \"properties\": {\n    \"summary\": {\n      \"description\": \\\"A 100-200 word paragraph summarizing the lyrics directly, capturing key messages, core emotional themes, and feelings. \\\nThe focus is on describing life situations and experiences portrayed without using phrases like 'the song' or 'the lyrics.'\\\\\",\n      \"title\": \"Summary\",\n      \"type\": \"string\"\n    },\n    \"emotions\": {\n      \"description\": \"The top two emotions observed in the lyrics. Two emotions must be different\",\n      \"items\": {\n        \"$ref\": \"#$defs/Emotions\"\n      },\n      \"title\": \"Emotions\",\n      \"type\": \"array\"\n    }\n  },\n  \"required\": [\n    \"summary\",\n    \"emotions\"\n  ],\n  \"title\": \"LyricExtract\",\n  \"type\": \"object\"\n}"}
{"key": "NEFFEX|||It’s My Life|||90", "primary_emotion": "Excitement", "supporting_emotion": "Hope", "summary": "I love the way you make me feel alive with excitement and hope. Your presence brings a sense of anticipation and longing, making me feel grateful for your place in my life. You bring balance to my emotions and help me see that even in dark times, there is always a chance at redemption."}
{"key": "NEFFEX|||Go!|||91", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "This song is a reflection of the human experience, capturing the emotions of sorrow, loneliness, and the struggle to move forward after experiencing pain and betrayal. The lyrics convey a sense of vulnerability and openness, as the protagonist searches for peace, forgiveness, and understanding. Through powerful storytelling, the song creates an atmosphere of contemplation, allowing listeners to connect with their own emotions and experiences."}
{"key": "NEFFEX|||Home|||92", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "This song is an emotional rollercoaster. It captures the bittersweet feeling of reminiscing about past experiences, where 'happily' and 'painfully' coexist. The lyrics portray a nostalgic longing for a bygone era, interwoven with sadness from unrequited love. The storyteller wistfully recalls memories both joyful and sorrowful. Ultimately, the song reflects on how even cherished moments can be tainted by melancholy. The top two emotions observed in these lyrics are Joy and Sadness."}
{"key": "NEFFEX|||Torn Apart|||93", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The song is about the struggle to find light in a seemingly hopeless situation despite the darkness that surrounds it. It captures the emotional rollercoaster of feeling numb, then suddenly bursting into tears as memories flooded back. The lyrics reveal a sense of nostalgia and longing for a past love, with the lines 'We used to be' and 'You were my everything' echoing pain and regret. Despite the turmoil, there's a glimmer of hope as the speaker reaches out to reconnect with their emotions and learn to heal. "}
{"key": "NEFFEX|||Statement|||94", "primary_emotion": "Confidence", "supporting_emotion": "Hope", "summary": "As the song describes, despite the challenges and difficulties they faced, their newfound community provided them with a sense of belonging and support. The lyrics highlight this journey of self-discovery as the narrator becomes more confident in themselves, gradually forming strong connections with others. Through vulnerability and openness, they learn to navigate the ups and downs of life with greater ease. This transformation is characterized by themes of growth, hope, and ultimately, a deeper understanding of oneself."}
{"key": "NEFFEX|||Time|||95", "primary_emotion": "Hope", "supporting_emotion": "Freedom", "summary": "Living life to the fullest with courage and zest, this song is about embracing the unknown and finding freedom in uncertainty. The lyrics weave a tale of hope and resilience, inspiring listeners to take risks and pursue their dreams. With a message that is both empowering and uplifting, this song encourages us to let go of our fears and doubts, and instead, soar into the unknown with confidence and determination."}
{"key": "NEFFEX|||Hungover|||96", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics express a sense of sadness and regret for the loss of a loved one. The speaker reflects on the memories they shared with the person, conveying a deep emotional pain. Meanwhile, their desire to be reunited with the person in the afterlife drives their hope of seeing them again."}
{"key": "NEFFEX|||Fall Asleep|||97", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "In the lyrics, the narrator describes their memories and emotions as they reflect on a past experience. The lyrics convey a sense of nostalgia and longing for something that has been lost. The speaker's emotional journey takes them through moments of sadness and melancholy, but ultimately, they find comfort in looking back and reminiscing about the good times. "}
{"key": "NEFFEX|||INSPIRED|||98", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song is about the struggles of a relationship and the emotions that come with it. The lyrics convey a sense of sadness and longing as the speaker reflects on the memories they shared with their partner. However, there's also a glimmer of hope that things can get better if they work together to overcome their issues. The song's tone is melancholic yet optimistic, capturing the complexity of human emotions."}
{"key": "NEFFEX|||Play Dead|||99", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "This song is about the journey of life and the emotions that come with it. The lyrics capture the ups and downs of human experience, from moments of joy and love to times of sadness and regret. The song takes a journey through these different emotions, highlighting the highs and lows and emphasizing the importance of living in the present moment. Through this journey, the song encourages listeners to find happiness and peace within themselves, even in the darkest of times."}
{"key": "NEFFEX|||Here to Stay|||100", "primary_emotion": "Nostalgia", "supporting_emotion": "Anger", "summary": "In this song, the speaker reminisces about past experiences and emotions, capturing a mix of happy and sad feelings. The lyrics portray a life situation where the individual is reflecting on memories that bring both nostalgia and anger. This duality showcases the complex nature of emotional responses, often intertwined with the passage of time."}
{"key": "NEFFEX|||Roller Coaster|||101", "primary_emotion": "Freedom", "supporting_emotion": "Confidence", "summary": "The lyrics describe a sense of freedom and confidence that comes with embracing one's true self. The song portrays the journey of self-discovery and acceptance, highlighting the importance of being authentic and unapologetic. Throughout the lyrics, it is clear that the speaker has overcome their insecurities and is now living an empowered life.\n\nCore emotional themes include empowerment, self-acceptance, and freedom. The overall atmosphere is uplifting and inspiring, providing a sense of hope for listeners who may be struggling to find their own direction.\n"}
{"key": "NEFFEX|||Born A Rockstar|||102", "primary_emotion": "Hope", "supporting_emotion": "Nostalgia", "summary": "Imagine a world where every person can coexist in harmony, without any hatred or discrimination. The song speaks about bringing people together, promoting unity and peace. It encourages listeners to imagine a better future where everyone is treated equally and is valued for their unique qualities. The lyrics highlight the importance of empathy, understanding, and compassion in creating such a world."}
{"key": "NEFFEX|||REVOLUTION|||103", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "Insecurities and self-doubt can be suffocating, making it hard to take risks and move forward. This song's lyrics beautifully capture the struggle of navigating uncertain situations. The speaker pours their heart out, sharing intimate moments of vulnerability and honesty. It's a poignant reminder that we're not alone in our fears and insecurities. With every risk taken, there's a possibility of growth, discovery, and freedom. The lyrics weave a story of self-discovery, urging the listener to take a leap of faith, embracing the unknown with courage and resilience."}
{"key": "NEFFEX|||My Way|||104", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "In the song, the narrator reflects on past experiences and relationships, exploring themes of nostalgia, hope, and forgiveness. The lyrics describe moments of joy and love, but also ones of regret and sadness. Through storytelling, the narrator seeks solace in memories of good times, while acknowledging past hurts and betrayals.\n"}
{"key": "NEFFEX|||THAT’S WHAT IT TAKES|||105", "primary_emotion": "Excitement", "supporting_emotion": "Hope", "summary": "The song 'Lyrics' starts off with the lyrics 'Let's go' and 'Yo'' followed by mentioning that 'pieces is a form of art.' This snippet seems to be setting the tone for an energetic and possibly artistic vibe, though it's difficult to gather more without seeing additional lyrics. The emotions expressed are mainly Excitement and Hope."}
{"key": "NEFFEX|||When I Was Young|||106", "primary_emotion": "Love", "supporting_emotion": "Fear", "summary": "This song's lyrics describe the emotional turmoil of a person who is struggling to come to terms with their past mistakes. The song expresses feelings of love and fear, as the protagonist tries to make amends and find forgiveness. The lyrics capture the complexity of human emotions and the struggle for self-acceptance. The core theme is seeking redemption and trying to move forward."}
{"key": "NEFFEX|||Want Me|||107", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "The song presents a reflection on the complexities of human relationships, exploring themes of trust, choice, and personal growth. It delves into the intricacies of communication, highlighting the blurred lines between intimacy and aloofness. The lyrics vividly portray the struggles to find balance in professional and personal life, as well as the emotional toll of making difficult choices. Ultimately, the song invites listeners to contemplate their own relationships and the trade-offs inherent in navigating love, friendship, and identity."}
{"key": "NEFFEX|||Lost Within|||108", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The song is a heartfelt ballad that explores the theme of nostalgia and longing. It's about cherishing memories and learning to let go of the past. The lyrics are full of vivid imagery, with the singer reminiscing about their youth and the person they loved. They lament the fact that time has passed them by and that life will never be the same again. This song is a beautiful reflection on the fleeting nature of love and life. It inspires listeners to hold on to treasured moments and savor each second. The emotions expressed are those of love, nostalgia, and melancholy."}
{"key": "NEFFEX|||Desperate|||109", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "A song about the journey, the search for meaning and purpose through life's challenges and hardships. It explores the human spirit's capacity to persevere in the face of adversity, and highlights the value of resilience and determination in transforming trials into triumphs, ultimately celebrating the beauty and fragility of life."}
{"key": "NEFFEX|||Go Hard|||110", "primary_emotion": "Love", "supporting_emotion": "Sadness", "summary": "This song is about a person reflecting on their past experiences and relationships, with a focus on the emotional highs and lows. The lyrics capture moments of joy and love, as well as feelings of sadness and regret. Ultimately, the song suggests that life's experiences shape us into who we are today."}
{"key": "NEFFEX|||Hey Yea|||111", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "As the lyrics unfold, it becomes clear that the song is about memories of the past and the longing for a love that has passed away. The narrator reminisces about the time they spent together, the laughter, and the tears. Despite the sadness, there's a sense of nostalgia and joy in remembering the good times. The emotional spectrum ranges from sadness to gratitude, but ultimately, it's a celebration of love and life."}
{"key": "NEFFEX|||Gossip|||112", "primary_emotion": "Regret", "supporting_emotion": "Sadness", "summary": "This soulful song is about a person who is trying to make sense of their life, despite the struggles and hardships they face. The lyrics capture the emotional highs and lows that come with this journey. The emotion at the heart of this song is **Regret**, which stems from the realization that you can't turn back time. Alongside regret, there's a tinge of **Sadness** that reflects on all the missed opportunities and failed relationships."}
{"key": "NEFFEX|||SOMETHING YOU COULD NEVER OWN|||113", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "The song's lyrics revolve around the themes of reminiscence and longing. The speaker reflects on their past experiences and relationships, remembering moments that shaped their present. This recollection is filled with nostalgia, as they cherish memories and acknowledge their growth. Meanwhile, joy seeps in through the acknowledgment of accomplishments and the understanding that life has unfolded the way it was meant to."}
{"key": "NEFFEX|||Better Days|||114", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song tells the story of a person who has had a plethora of experiences with love and heartbreak. The lyrics vividly portray the memories and emotions that linger long after a relationship has ended. The theme of nostalgia is prominent, as the speaker reflects on the joy and pain of past loves. Despite the turmoil, there's a sense of hope and freedom in moving forward. This narrative is woven together by the repetition of phrases and the use of vivid imagery, creating a rich tapestry that explores the human experience of love and loss.\n"}
{"key": "NEFFEX|||Hometown|||115", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "The lyrics vividly portray the heartache and longing that follows the demise of a past relationship. The speaker's emotions are raw, with feelings of nostalgia and regret dominating their thoughts. Memories of the good times shared with their former lover weigh heavily on their mind, making it difficult to move on from the pain caused by the breakup. The lyrics convey the depth of human emotions when faced with heartbreak, as the speaker struggles to find closure and acceptance."}
{"key": "NEFFEX|||One of a Kind|||116", "primary_emotion": "Joy", "supporting_emotion": "Loneliness", "summary": "The lyrics describe a situation where the narrator finds joy in the mundane details of life with their loved one, sharing moments together, laughing, smiling, and feeling grateful for the time they spend together. This happiness is intertwined with feelings of loneliness that arise when they are apart, creating a longing to be reunited. The song captures the ups and downs of relationships, showcasing the beauty of love amidst the difficulties. Core emotions include Joy, Loneliness. The lyrics present life situations such as sharing everyday moments, cherishing memories, and dealing with separation."}
{"key": "NEFFEX|||100 (Count It)|||117", "primary_emotion": "Love", "supporting_emotion": "Peace", "summary": "I just wanna steal your guitar and play all night You'll feel alive, don't you ever stop to think, I just wanna steal this moment take a shot with all my heart Because loving someone else could never be as real As the love that we share in our own little world You know that when I'm with you, it's like the music never ends No matter where the road may lead us, we'll always have each other The memories of that night, the feeling that I get When I am making love to you. It is love."}
{"key": "NEFFEX|||Worst of You|||118", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "John Legend's 'Ordinary People' song is an emotional rollercoaster that captures life's ups and downs. The lyrics describe the struggles of a middle-class family, highlighting the importance of staying together through the tough times and appreciating what you have. John Legend pours out his heart in this soulful tune, making it easy for listeners to relate to the vulnerability and sincerity expressed in the song."}
{"key": "NEFFEX|||Blessed|||119", "primary_emotion": "Confidence", "supporting_emotion": "Gratitude", "summary": "The lyrics portray a story of self-discovery and growth, capturing the emotions of confidence, gratitude, and hope as one navigates through life's challenges and uncertainties. As the protagonist reflects on their past experiences, they realize that learning to forgive themselves and others has been crucial in their journey towards inner peace and freedom."}
{"key": "NEFFEX|||Touch the Sky|||120", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics describe the struggles of someone who feels lost and alone in life, with a deep desire for connection and understanding. Despite the presence of emotions like sadness and anger, there's a sense of hope and determination to find a way forward. The core emotional theme is the pursuit of freedom from emotional pain and the need to feel seen and accepted."}
{"key": "NEFFEX|||WOW!|||121", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "Summary of the lyrics: Heartbreak is a powerful experience that can be felt deeply by those who have gone through it. The song's narrator reminisces about their past love and how they had to go their separate ways, with a sense of regret and longing. They recall the good times and memories they shared, but also acknowledge the pain and struggle involved. Emotions are woven throughout the narrative, including sadness, nostalgia, and possibly even a hint of frustration for having been apart too long. Ultimately, the lyrics convey a deep emotional connection between two people who have experienced heartbreak together."}
{"key": "NEFFEX|||Free Me|||122", "primary_emotion": "Hope", "supporting_emotion": "Desire", "summary": "This song is about the struggles and sacrifices that come with pursuing one's dreams. It highlights the emotional rollercoaster that an individual goes through, from feelings of Joy and Nostalgia when reminiscing about past successes to Feelings of Sadness and Regret when reflecting on the costs of achieving their goals. The song ultimately conveys a message of Hope and Desire for a better future."}
{"key": "NEFFEX|||Bros B4 Hoes|||123", "primary_emotion": "Nostalgia", "supporting_emotion": "Gratitude", "summary": "One of my favorite songs is 'Precious' by Jewel. This song is about the beauty and value of memories, especially those made with loved ones. The lyrics convey a sense of nostalgia and gratitude for the time spent together, emphasizing how these moments are truly precious. The song's message is relatable to many people as it encourages us to appreciate these special moments rather than taking them for granted. Key messages include cherishing the time we have, being present with loved ones, and appreciating life's little joys."}
{"key": "NEFFEX|||Summer|||124", "primary_emotion": "Fear", "supporting_emotion": "Confidence", "summary": "The life situation portrayed in the lyrics is that of a person who is struggling to find their place in the world. They feel lost and uncertain about their future, and this feeling of being stuck in a rut has led them to question their identity and purpose. The core emotional theme that emerges from this lyrics is one of introspection and self-awareness as the person seeks to understand themselves better. This introspection also leads them to confront their fears and doubts, which in turn allows them to gain confidence and hope for a brighter future."}
{"key": "NEFFEX|||Rare|||125", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song is a nostalgic reminiscence of a past relationship, with lyrics that poetically capture the ups and downs of love and loss. The song's narrative is woven through a tapestry of memories, regrets, and longing, as the protagonist reflects on what could have been. With its poignant verses and soothing melody, this song is an ode to the impermanence of life and our inherent desire for human connection. The lyrics expertly convey the emotional complexity of relationships, from the euphoria of new love to the pain of heartbreak."}
{"key": "NEFFEX|||Take Me Back Again|||126", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "The lyrics express a feeling of love and nostalgia, with the speaker reminiscing about a past relationship that they wish would never end. They reflect on the memories they shared together, describing their moments as 'golden'. The use of phrases such as 'Yeah, yeah, yeah' creates a sense of longing and yearning."}
{"key": "NEFFEX|||Merry Litmas|||127", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "For this time of year, so filled with festive cheer and winter's snowflakes gently falling, I am reminded of the joy and love that fills my heart as I share moments with loved ones, savoring traditions and memories. With each passing day, the feeling grows stronger. It is a precious gift to cherish in these fleeting years of life."}
{"key": "NEFFEX|||IT’S ONLY WORTH IT IF YOU WORK FOR IT|||128", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song recounts the emotional highs and lows of a relationship. The lyrics describe the thrill of falling in love, the comfort of being with someone, and the pain of heartbreak. The speaker's experiences and emotions are vividly portrayed, from the euphoria of new love to the agony of loss. The song serves as a reminder that life is full of moments both profound and trivial, and that our emotional journeys are what make it worth living."}
{"key": "NEFFEX|||Till I Let Go|||129", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song is about a person who has tried everything to move on from their past relationship, but they can't help feeling the same emotions and memories that make them struggle to let go.\nTheir story is one of longing and heartache, as they try to process their feelings and find closure.\nThrough poetic lyrics and soaring melodies, this song takes listeners on a rollercoaster ride of emotions,\nexploring the complexities of love, loss, and the human experience."}
{"key": "NEFFEX|||Ruthless|||130", "primary_emotion": "Hope", "supporting_emotion": "Fear", "summary": "The lyrics describe the longing for a better life and the struggles that come with it. The song is an anthem of hope and resilience in the face of adversity. It speaks about the desire to break free from a difficult situation or relationship, seeking freedom, peace and inner strength. The emotional theme of this song is one of empowerment and determination. The lyrics are a testament to the human will to overcome obstacles and build a better future."}
{"key": "NEFFEX|||Forget ’em|||131", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "The song is a beautiful reflection on the complexities of love and relationships, highlighting the joy that can be found in these experiences as well as the sadness and regret that can also accompany them. Despite the ups and downs, the lyrics ultimately convey a message of hope and peace, reminding us to cherish every moment and not take our loved ones for granted."}
{"key": "NEFFEX|||Get Through|||132", "primary_emotion": "Excitement", "supporting_emotion": "Nostalgia", "summary": "Life is about making choices and taking risks. The lyrics capture the essence of a person who is on a journey, leaving their small town behind to pursue their dreams. The speaker reflects on the past, remembering the people they left behind, but also expressing excitement for the unknown ahead. They're not really sure where they're going, but they're willing to take the chance and see what life has in store for them."}
{"key": "NEFFEX|||I’ve Been Let Down|||133", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "You are the one I long for, but they're not on my side. As much as I desire to be with you, it seems like an impossible dream. I've tried to put out the flames of passion, but they still burn bright within me. It's hard to understand why we can't just be together, considering our bond is strong and true. But for now, I'll keep holding onto hope that someday things will change."}
{"key": "NEFFEX|||Take It|||134", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song is a nostalgic and emotional reflection on past relationships. The lyrics speak directly to the pain of lost love, with phrases like 'we were never alike' emphasizing the differences between the two people involved. Despite this, there's still a sense of longing and hope for something more profound. This theme is underscored by the lyrics' focus on memories, both real and imagined."}
{"key": "NEFFEX|||FOYF|||135", "primary_emotion": "Nostalgia", "supporting_emotion": "Confusion", "summary": "The song depicts the struggle of growing up and the confusion that comes with it.\nThe lyrics highlight the feelings of nostalgia and longing for something that can never be recaptured.\nIt also touches on emotions of regret, sadness, love, and hope as we search for answers to questions we don't know how to answer."}
{"key": "NEFFEX|||Comeback|||136", "primary_emotion": "Sadness", "supporting_emotion": "Desire", "summary": "In the song's poignant narrative, themes of love and heartache unfold as the protagonist reflects on mistakes made in pursuit of selfish desires. The lyrics describe a stifling existence where personal freedom is sacrificed for fleeting pleasures, eventually leading to soul-destroying emptiness. This introspective tale showcases the universal struggle of reconciling personal ambitions with emotional well-being. "}
{"key": "NEFFEX|||Runaway|||137", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song by The Score is a heartfelt ballad that captures the pain and nostalgia of losing someone dear. The lyrics are a poignant eulogy to a past love, with the protagonist reflecting on memories shared and the longing for what could have been. The core emotional theme is deep sadness for the loss, but there's also a sense of hopefulness as the narrator grapples with the what-ifs and maybes. Overall, this song is an intimate and emotional reflection on the human experience."}
{"key": "NEFFEX|||When It Flows|||138", "primary_emotion": "Joy", "supporting_emotion": "Nostalgia", "summary": "Life can be challenging and filled with difficult situations, which is portrayed in this song through its lyrics directly. It focuses on describing the feelings and emotions that come along with these experiences and portrays a journey of finding closure as a way to heal from them. The core emotional theme depicted in this song are Joy and Nostalgia."}
{"key": "NEFFEX|||Climb|||139", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics of this song narrate the story of a person who has been hiding their feelings for someone for so long, and they finally find the courage to confess their love. The poem is about the struggle of putting on a mask in front of others and the overwhelming desire to set free one's true emotions. It paints a picture of life situations where people often put up a facade to hide their genuine feelings."}
{"key": "NEFFEX|||Hell Won’t Take Me|||140", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "The song's lyrics procure their emotions and thoughts in a meaningful way. The narrator expresses their personal experiences, capturing joy, sadness, and hope. They describe the pain of loss and the struggle to find meaning. These themes are woven together by the thread of emotional introspection, allowing the listener to connect with the artist's journey. In doing so, the song creates a sense of intimacy and authenticity that resonates deeply."}
{"key": "NEFFEX|||A Feeling|||141", "primary_emotion": "Hope", "supporting_emotion": "Nostalgia", "summary": "This song is about the intense emotions that follow when one person can't let go of a past memory or experience, and it's affecting their current life in a significant way. The lyrics convey a sense of longing and yearning for something that's been lost, and how it's impacting their daily routine, relationships, and overall mindset. The song captures the complexities of nostalgia, love, and heartache, showcasing how these emotions can be both liberating and suffocating at the same time."}
{"key": "NEFFEX|||Anxiety|||142", "primary_emotion": "Nostalgia", "supporting_emotion": "Gratitude", "summary": "This song is a nostalgic recollection of memories experienced during the youthful stage of life. The lyrics describe the struggles and mistakes made during this period, as well as the importance of cherishing the relationships that have been formed. It encourages the listener to truly appreciate what they have and not take anything for granted."}
{"key": "NEFFEX|||Don’t Hate Me|||143", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "This popular song is a nostalgic reflection of memories shared with someone special. The lyrics capture the joy and excitement of new love, followed by the pain and sadness that ultimately follows its demise. As the speaker reminisces about their time together, they realize that the good times are what truly matter."}
{"key": "NEFFEX|||Modest|||144", "primary_emotion": "Hope", "supporting_emotion": "Regret", "summary": "Life can be unpredictable and unforgiving, but there is hope and resilience that can help us push through and persevere despite setbacks and struggles. The lyrics of this song reflect on the importance of having enough money to meet our basic needs, while also exploring themes of love, happiness, and personal growth. Through a series of relatable life experiences, we learn to adapt, compromise, and prioritize our values, ultimately finding balance and fulfillment in life."}
{"key": "NEFFEX|||Stand Up|||145", "primary_emotion": "Hope", "supporting_emotion": "Desire", "summary": "This song is about perseverance and never giving up on your dreams. It talks about overcoming obstacles and staying strong through life's challenges, using lyrics like 'I've been fighting for a long time' to emphasize the importance of persistence. The song also highlights the value of learning from mistakes and using them as opportunities for growth. The message of the song is to keep pushing forward, even when things get tough."}
{"key": "NEFFEX|||Villains and Heroes|||146", "primary_emotion": "Confusion", "supporting_emotion": "Peace", "summary": "Throughout this song, the artist vividly narrates a story about the struggle to find oneself and overcome self-doubt. The lyrics highlight the emotional toll of societal expectations and the pressure to conform, leading to feelings of disconnection and isolation. The core theme is one of introspection and self-discovery, with the protagonist seeking answers and reassurance in the midst of uncertainty and chaos. As an artist shares their personal stories and emotions, they express gratitude for having a platform to share their truth and vulnerability."}
{"key": "NEFFEX|||Mystify|||147", "primary_emotion": "Hope", "supporting_emotion": "Confidence", "summary": "The lyrics talk about the struggles of life, the importance of living in the moment, and the need to let go of past regrets. The song is an uplifting message urging people to be true to themselves and live life with no apologies. It encourages listeners to be brave, take risks and find happiness through self-acceptance and self-love. The tone is inspirational and motivational. The two emotions that can be observed in the lyrics are Hope and Confidence."}
{"key": "NEFFEX|||Addict|||148", "primary_emotion": "Desire", "supporting_emotion": "Sadness", "summary": "The lyrics of this song are a reflection of a yearning and longing for something more. The speaker is always craving for more, suggesting that they may feel unfulfilled or incomplete. This theme is conveyed through the repetition of 'always craving for more', emphasizing their relentless desire for something more. The emotions evoked by these lyrics include Desire, Sadness"}
{"key": "NEFFEX|||Take Me Back|||149", "primary_emotion": "Nostalgia", "supporting_emotion": "Freedom", "summary": "The lyrics portray a situation where the speaker is trying to make sense of their current life after experiencing a significant loss or failure. They are filled with feelings of sadness, regret, and nostalgia for what could have been. Throughout the song, they convey a deep longing for freedom from these emotions and to be able to move forward. The core emotional themes presented include Nostalgia, Sadness, Regret, Desire (for change), Peace, and Freedom."}
{"key": "NEFFEX|||Hype|||150", "primary_emotion": "Joy", "supporting_emotion": "Freedom", "summary": "This song is about not finding what you're looking for and the nostalgia that comes with it, as well as feeling a sense of freedom from letting go of past experiences. It's a emotional rollercoaster that resonates deeply with listeners. The lyrics take you on a journey through memories, heartaches, and the struggle to move forward. You can't help but feel a mix of Joy and Freedom."}
{"key": "NEFFEX|||PINKY PROMISE|||151", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "In the song 'I Promised Myself', the lyrics reflect on memories and moments that linger after a breakup. The narrator's voice conveys a sense of longing, searching for answers in the fleeting moments that remain. This emotional introspection delves into the complexities of relationships, exploring the blurred lines between love, sadness, and regret. Ultimately, the song serves as a poignant reminder that even in heartache, there is always a glimmer of hope and chance to learn from past experiences."}
{"key": "NEFFEX|||Hate It or Love It|||152", "primary_emotion": "Regret", "supporting_emotion": "Nostalgia", "summary": "The song 'Kings...' by Volume 4 is about a life situation where one is trying to make sense of the world. It's about being lost and alone, but still finding joy in the little moments. The lyrics convey a mix of sadness and nostalgia, with hopes for a better tomorrow."}
{"key": "NEFFEX|||Unavailable|||153", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The lyrics of the song 'Someone Like You' by Adele are a heartfelt and emotional ballad about lost love and longing. The song is written from the perspective of someone who has had to let go of their true love, as they try to move on with their life and find closure. The core emotional themes depicted in the lyrics include Nostalgia, Sadness, Regret, Hope, and Anger.\n"}
{"key": "NEFFEX|||CEO|||154", "primary_emotion": "Gratitude", "supporting_emotion": "Nostalgia", "summary": "With the passage of time, life is a precious gift. The lyrics convey the emotional theme of gratitude and appreciation for the journey we've been on so far. They highlight the importance of cherishing those moments and relationships that bring us joy and fulfillment. This sentiment encourages listeners to reflect on their lives, acknowledging the beauty in every stage, whether it's triumph or adversity. Through this introspective process, we can gain a deeper understanding of ourselves and our place within the world."}
{"key": "NEFFEX|||Tell Me That I Can’t|||155", "primary_emotion": "Hope", "supporting_emotion": "Confidence", "summary": "The song is about a person who has gone through a tough time in their life and has come out stronger from it. It captures the journey of learning to love oneself, overcoming fears and doubts, and embracing new experiences with an open heart. The lyrics convey a sense of hope and resilience in the face of hardship."}
{"key": "NEFFEX|||Good Day (Wake Up)|||156", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "The song's lyrics convey the beauty of their past and present love story. The narrative is woven around a couple that has grown old together, reminiscing about the beauty they once had. The lyrics capture the essence of nostalgia, as they reminisce about the memories they've shared throughout the years. They're celebrating the life they've built together, and cherishing every moment they have left. The emotions are filled with love, gratitude, and a hint of sadness. Ultimately, the song is a beautiful eulogy to their enduring love."}
{"key": "NEFFEX|||Built To Last|||157", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "The lyrics describe the emotional journey of a person who has gone through a life-altering change, such as a breakup or losing a loved one. The poem delves into the feelings of sadness, nostalgia, and longing that follow the departure of a significant other. It explores the theme of heartbreak and the struggle to move on from past experiences. Despite the pain and sorrow, there is also a sense of hope and resilience that emerges as the speaker begins to heal and find peace once again. The emotions served are Joy and Hope."}
{"key": "NEFFEX|||Messed Up|||158", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song is an ode to the fleeting nature of love and relationships. The lyrics poignantly capture the longing and yearning that comes with knowing a connection will soon be lost. The emotional themes are centered around feelings of sadness, regret, and nostalgia as the speaker reflects on past experiences and current circumstances. Despite the melancholic tone, there's a sense of hope and desire for something new to emerge."}
{"key": "NEFFEX|||Immortal|||159", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "The lyrics are a poignant reflection on the bittersweet nature of life's experiences. They capture the essence of hope and love as powerful motivators, highlighting how these emotions can drive individuals to strive for something more meaningful. The vivid descriptions of people and events evoke strong emotions, making the listener feel like they are directly experiencing the story being told."}
{"key": "NEFFEX|||Keep Dreaming|||160", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "In this emotional ballad, the singer pours their heart out about a failed relationship, capturing core emotional themes of sadness, regret and hope for a better future. The lyrics paint a vivid picture of a crumbling love, with the protagonist reflecting on what went wrong and yearning for a second chance. Two emotions that stand out are Sadness and Hope."}
{"key": "NEFFEX|||Warrior|||161", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "In this song, the artist reflects on a significant moment of failure and perseverance. The lyrics recount the story of a person who tries to hold onto something that is slipping away, but ultimately succumbs to disappointment and sadness. This relatable narrative allows listeners to connect with their own experiences of feeling defeated or frustrated. Throughout the song, the emotions of sadness, defeat, and regret are woven together in a poignant expression of the human struggle to come to terms with loss. The lyrics also touch on themes of acceptance, healing, and the pursuit of hope and freedom."}
{"key": "NEFFEX|||A Little Fucked Up|||162", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "This iconic song tells the story of a person's longing for an old flame who haunts their thoughts and memories. The lyrics vividly portray the emotional turmoil that follows a breakup, with the narrator pining for what could have been. Through powerful storytelling, the song skillfully conveys the pain, regret, and ultimately, hope for new beginnings.\n\nThe narrative takes us on a journey of nostalgia, as the narrator reminiscences about the good old days with their former love, filled with laughter, adventure, and whispered promises.\n\nThroughout the song, there are moments of sadness and despair, but also fleeting glimmers of joy and optimism for what may come. The emotions expressed are raw, genuine, and deeply relatable,\nit is no wonder why this timeless classic continues to captivate audiences across generations with its enduring message of never saying never.\n"}
{"key": "NEFFEX|||Stay Strong|||163", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "In this song, the lyrics speak of joyful memories that seem so clear when we're young and free, but as time passes, the tempest fades away and nostalgia takes over. The core emotional themes are long-lasting happiness and regret for what's lost. Life situations portrayed include reminiscing about past loved ones and experiences."}
{"key": "NEFFEX|||Manifest It|||164", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song's lines recall the struggles of those who have had to leave behind their homes and start anew. The lyrics express feelings of sadness, longing, and disorientation as they navigate unfamiliar surroundings. The song's protagonist speaks of how their own experiences, like having to abandon everything they knew and loved, brought them to a place where they felt lost and alone. The song serves as a reminder that even in the darkest moments, there is always hope for a brighter future. Also, nostalgia and regret are present throughout the lyrics. "}
{"key": "NEFFEX|||Purpose|||165", "primary_emotion": "Hope", "supporting_emotion": "Fear", "summary": "It is a beautiful love song despite the risks. The lyrics convey a sense of fear and uncertainty, as the speaker is aware of the potential consequences of their actions. Despite this, they are drawn to the other person and are willing to take the chance. This is evident in lines such as 'I'm still feeling' and 'I'm trying to get through.' These phrases showcase the intensity of the emotions involved and emphasize the speakers desire for a connection with the other person. Ultimately, the lyrics offer a glimpse into the complexities of human relationships and the beauty that can be found amidst uncertainty."}
{"key": "NEFFEX|||Tough|||166", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "A poignant reflection on the fleeting nature of life is presented in these lyrics. The song's lyrics convey a sense of longing for past moments, memories and experiences that will never be recaptured. The narrative weaves a tapestry of nostalgia, as the speaker romanticizes about what could have been and pines for a return to those bygone days. This bittersweet tale is characterized by an intense emotional yearning, a deep sense of sorrow, and a profound resignation to the passage of time."}
{"key": "NEFFEX|||Losing My Mind|||167", "primary_emotion": "Joy", "supporting_emotion": "Nostalgia", "summary": "The song's lyrics convey a sense of longing and nostalgia as the narrator reminisces about past experiences and relationships that have gone sour. The bittersweet feeling is palpable, capturing both the pain of loss and the joy of cherished memories. Key messages include the fleeting nature of happiness, the importance of holding on to love, and the struggle between embracing new beginnings and preserving nostalgia for what's been. This song captures the essence of human experiences, showcasing the intricate balance between light and darkness."}
{"key": "NEFFEX|||TIL I HEAR ’EM SAY|||168", "primary_emotion": "Hope", "supporting_emotion": "Confidence", "summary": "In this upbeat track, the artist recounts their whirlwind experience of finding love in an unexpected place. The song's energetic chorus captures the emotional rollercoaster that often accompanies a new romance. Key themes include vulnerability, excitement, and the thrill of the unknown as they explore the highs and lows of relationships. Emotions experienced through the lyrics range from confidence and hope to nervousness, anticipation, and ultimately, gratitude for having found something special. With its catchy melody and poignant lyrics, this song showcases the complexity of love in modern times."}
{"key": "NEFFEX|||Learning to Let Go|||169", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "Despite the challenges and difficulties faced in a previous relationship, the speaker is determined to move on and create a new life. The lyrics convey a sense of resilience and hope as the person begins to heal from past wounds. Key messages highlight the importance of self-reflection, personal growth, and the process of rebuilding oneself after an emotional storm."}
{"key": "NEFFEX|||Just Breathing|||170", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "Music is the best way to understand others. It can bridge cultural gaps and help people feel less lonely. In this song, lyrics are focused on building relationships and love that lasts. It's about understanding that it takes work to make things thrive. The lyrics describe living together, growing with each other and appreciation., It's like saying you're my someone special and I'm the one for you. "}
{"key": "NEFFEX|||Better on Your Own|||171", "primary_emotion": "Fear", "supporting_emotion": "Hope", "summary": "The lyrics describe a longing and searching for something more, a yearning that drives us to take risks and push through the unknown. This song captures the emotional turmoil that comes with having our hearts exposed, and the uncertainty that surrounds every decision we make. It's a raw and honest reflection of the human experience, exposing the vulnerability and fear that lies at the core of our most intimate moments."}
{"key": "NEFFEX|||Party Like The 80s|||172", "primary_emotion": "Excitement", "supporting_emotion": "Hope", "summary": "These lyrics speak to the idea of moving forward and embracing change. With lines like 'we're ready for a new state', the song highlights the importance of being adaptable and open-minded. The emotions felt here are primarily Excitement and Hope as the speaker is eager to dive into this new chapter, leaving uncertainty behind."}
{"key": "NEFFEX|||Winning|||173", "primary_emotion": "Sadness", "supporting_emotion": "Anger", "summary": "This song is about struggling to come to terms with the end of a relationship. It captures the emotional turmoil that follows this kind of loss, as the lyrics convey feelings of Sadness and Anger. The song's narrative explores the longing for what could have been, the pain of the memories that linger, and the frustration with the uncertainty of what lies ahead."}
{"key": "NEFFEX|||Never Back Down|||174", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "Being trapped in someone else's life is a constant struggle for many people. You're always thinking about what could've been if you had made different choices or taken a different path. The lyrics capture the emotions of longing and nostalgia that often accompany regrets of the past. It's a tale of trying to fit into someone else's reality, feeling lost and disconnected from your own life. The emotional turmoil is palpable as the narrator grapples with the idea of being stuck in a situation that's not their own. Two dominant emotions observed are Nostalgia and Sadness."}
{"key": "NEFFEX|||Head Down|||175", "primary_emotion": "Joy", "supporting_emotion": "Confidence", "summary": "This song is a celebration of the journey towards self-discovery and growth, as an individual learns to let go of past grievances and fears. The lyrics capture key messages, core emotional themes, and feelings, describing life situations and experiences portrayed without using phrases like 'the song' or 'the lyrics.' The narrative follows a protagonist who is Joyful and Confident."}
{"key": "NEFFEX|||Haunt|||176", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The pain of longing is a bittersweet reminder of what could have been, had we taken a different path. In this song, the lyrics vividly capture the struggles of a relationship that has gone sour, with emotional highs and lows unfolding like a rollercoaster ride. The listener is drawn into the world of the narrator, who pours out their heart in soulful declarations of love, hurt, and regret, ultimately searching for catharsis and resolution. The emotions are raw and intense - despair, sadness, and frustration mingle with flashes of hope and optimism, creating a sense of vulnerability and openness. The lyrics are less about what happened in the relationship and more about how it has affected the narrator's soul."}
{"key": "NEFFEX|||Chasing|||178", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "This song is a reflection on the importance of personal growth and self-discovery. It explores the emotions that accompany this journey and highlights the need to confront one's fears and desires in order to truly grow as an individual. The lyrics also touch on the themes of nostalgia, regret, and hope as they relate to the passage of time and the search for meaning. Overall, this song can be seen as a poignant exploration of what it means to be human,\r\n\r\n"}
{"key": "NEFFEX|||Give Me A Sign|||179", "primary_emotion": "Love", "supporting_emotion": "Sadness", "summary": "This song is about the struggle of losing someone you love. It describes the pain and longing that comes with the loss of a loved one, as well as the efforts to move on from the grief. The lyrics also touch on the bittersweet nature of memories, as they can be both pleasant and painful depending on the context. "}
{"key": "NEFFEX|||How’s It Supposed to Feel|||180", "primary_emotion": "Sadness", "supporting_emotion": "Anger", "summary": "This is a summary of the lyrics directly capturing key messages core emotional themes and feelings focusing on describing life situations and experiences portrayed without using phrases like 'the song' or 'the lyrics'. This is the main message conveyed by the lyrics, including feelings such as Sadness and Anger, which are present throughout the song. These emotions add depth to the story and emphasize the significance of the events that occurred."}
{"key": "NEFFEX|||So Fine|||181", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "The song's lyrics revolve around the theme of heartbreak and longing for a past love. The lyrics vividly portray the pain, nostalgia, and memories of a lost relationship. They capture the emotions of regret, sadness, and hope that come with realizing that things have gone wrong. The song takes the listener on a nostalgic journey of reminiscing about past moments and yearning to turn back time. The emotional rollercoaster ride is intense as it delves into the complexities of human emotions, capturing the essence of heartbreak in an authentic way."}
{"key": "NEFFEX|||Sunday|||182", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "The lyrics describe a nostalgic feeling and are a reflection of the past experiences that have shaped who you are today. The lyrics convey a sense of sadness due to the loss of those experiences, but also convey a message of hope and encouragement for the future. As we get older, memories and experiences that we had in our youth can be bittersweet, leaving us with feelings of nostalgia and regret. In this song, the artist is reflecting on those experiences, acknowledging their value despite any pain they may have caused, and ultimately finding solace in the wisdom and perspective gained from them. This nostalgic feeling evokes a sense of introspection, self-awareness, and a longing for what could have been."}
{"key": "NEFFEX|||You Will Never See Me Coming|||183", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "Life is like a river that flows and turns along the way, with its ups and downs. The lyrics describe experiences that can evoke feelings of nostalgia and longing. The song talks about how life is full of unexpected twists and turns, and one must learn to adapt and navigate through them. It's a call to be open-minded and accept what life brings, embracing the journey and not getting stuck in any particular moment."}
{"key": "NEFFEX|||Tonight|||184", "primary_emotion": "Joy", "supporting_emotion": "Freedom", "summary": "The song's lyrics describe a person who is struggling to find their place in the world and feeling trapped by their circumstances. The speaker longs for freedom and the ability to make their own choices, ultimately finding solace in the knowledge that they are not alone. This sense of solidarity allows them to feel more at ease and hopeful about their future."}
{"key": "NEFFEX|||Till I’m On Top|||185", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "A summary of the lyrics highlights a heartfelt desire to grow and learn through life experiences, exploring themes of self-discovery and emotional resilience in the face of challenges. As the lyrics unfold, they reveal a profound sense of hope and optimism, emphasizing the importance of human connections and relationships. The narrative navigates the highs and lows of life, weaving together moments of joy, sorrow, and introspection to paint a rich tapestry of emotions."}
{"key": "NEFFEX|||This Is Not A Christmas Song|||186", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "The song lyrics vividly portray the joy and beauty of childhood memories. It's a nostalgic journey that takes you back to the carefree days when your biggest concern was picking out which crayon color to use next. The emotions evoked are those of love, peace, regret, and a deep longing for those simpler times."}
{"key": "NEFFEX|||Change|||187", "primary_emotion": "Sadness", "supporting_emotion": "Desire", "summary": "This song is a poignant ballad that captures the emotional highs and lows of a relationship. The lyrics convey a sense of longing, desire, and ultimately, heartbreak. Through vivid storytelling, the song explores themes of loss, nostalgia, and the struggle to find peace and freedom amidst the turmoil. As the narrative unfolds, it becomes clear that the protagonist is yearning for the love they once had, but now seem irretrievable. The song is an intimate reflection on the impermanence of relationships and the human need to move forward after heartache. In its candid portrayal of love's fragility and resilience, this song touches hearts and inspires introspection."}
{"key": "NEFFEX|||Price Tag|||188", "primary_emotion": "Regret", "supporting_emotion": "Desire", "summary": "Life situations and experiences portrayed in this song are about longing to go back in time to fix past mistakes. The lyrics convey a strong sense of regret for the choices made, which have led to the current situation. The song seems to express a deep desire to alter the course of events and restore relationships that have been damaged."}
{"key": "NEFFEX|||Rollin’ with the Devil|||189", "primary_emotion": "Joy", "supporting_emotion": "Loneliness", "summary": "The song is about the speaker's desire to be free from societal pressures and expectations. The lyrics capture a sense of Joy, as the speaker yearns for a life where they can express themselves without judgment. The music captures feelings of Loneliness and Gratitude, reflecting on past experiences and present struggles."}
{"key": "NEFFEX|||’Till I Collapse|||190", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "The song is a nostalgic rendition that reminisces about the good old days, bringing joy and comfort to those who are going through tough times. It also speaks about the importance of cherishing memories and finding solace in them. The lyrics emphasize how music can be a powerful tool for healing and providing emotional support. Furthermore, it highlights the significance of human connection and the impact it has on our well-being."}
{"key": "NEFFEX|||Things I’ll Never Miss|||191", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics talk about overcoming the pain and sadness of past relationships. It highlights how people hold onto memories, not realizing that it's holding them back from moving on. The song encourages listeners to focus on the present and live in the moment, rather than dwelling on what's gone. It also touches on the theme of forgiveness and letting go of negative emotions. The overall message is one of hope and resilience, reminding us that we are capable of healing and starting anew."}
{"key": "NEFFEX|||Sober|||192", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "In this song, the lyrics convey a sense of profound searching and longing, as well as a deep sense of nostalgia for something that has passed. The narrator expresses a strong desire to be reunited with someone or something, and the emotions conveyed are ones of hopelessness and despair. As the song unfolds, the listener is transported to a world where time stands still, and memories of the past come flooding back like a powerful tidal wave. Through its nostalgic lens, this song captures the timeless essence of what it's like to say goodbye to a cherished chapter in one's life."}
{"key": "NEFFEX|||What You Gonna Be|||193", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "This song is about the joys of living life to the fullest. The lyrics remind us that simple pleasures in life can bring immense happiness and fulfillment. It's a message of positivity and encouragement, urging listeners to cherish every moment and find beauty in the everyday. The tone is uplifting and motivational, leaving a lasting impact on those who resonate with its truth."}
{"key": "NEFFEX|||Shmack’d|||194", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song is about a person who's going through ups and downs in life. They're struggling to find their place, feeling lonely and lost, but at the same time, they're holding onto hope that things will get better. The emotions are all mixed up - there's sadness, regret for past choices, anger towards those who let them down, and a sense of desperation to be loved and accepted."}
{"key": "NEFFEX|||Take Control|||195", "primary_emotion": "Joy", "supporting_emotion": "Nostalgia", "summary": "Wale's song is a thought-provoking reflection on the importance of genuine human connection in a world that is increasingly focused on technology and social media. The lyrics poetically describe the joy and beauty of having meaningful conversations with others, highlighting the benefits of face-to-face interactions, and the emotional depth that comes from truly connecting with someone. This song conveys a deep sense of longing for deeper ties with others, and serves as a poignant critique of our society's reliance on digital means of communication."}
{"key": "NEFFEX|||Dreaming On|||196", "primary_emotion": "Sadness", "supporting_emotion": "Desire", "summary": "The lyrics describe a person who is constantly daydreaming about their perfect life. They are lost in thought, imagining every detail from the sun shining bright to the warmth of a loved one's touch. The core emotional theme is Nostalgia as the speaker longs for this idealized future. In contrast, the top two emotions observed in the song are Sadness and Desire."}
{"key": "NEFFEX|||My Mind|||198", "primary_emotion": "Joy", "supporting_emotion": "Nostalgia", "summary": "In this song, the artist narrates their emotional journey as they face setbacks and frustrations in their personal life. Despite these challenges, the lyrics convey a message of resilience and growth, showcasing how moments of struggle can ultimately lead to self-discovery and healing. The emotions portrayed include Joy, as the artist finds solace and hope, and Nostalgia, as they reflect on past experiences."}
{"key": "NEFFEX|||I Want More (Freestyle)|||199", "primary_emotion": "Joy", "supporting_emotion": "Regret", "summary": "These lyrics convey a sense of longing and regret as the speaker reflects on past relationships. The song's chorus repeats phrases like 'what I wouldn't give to turn back time' and 'if only you had stayed.' These statements capture the emotional turmoil that comes with lost love and missed opportunities. The speaker seems to be grappling with the knowledge that things could have been different if they had acted differently in the past. The core message is about appreciating the present moment and not taking life for granted, as we don't know what the future holds."}
{"key": "NEFFEX|||Inside|||200", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The song is about a person reflecting on their past and the choices they made. They are filled with regret for what could have been if they had taken different paths. The core emotional themes of this song are Sadness and Regret.\n\nIn the lyrics, the speaker seems to be going through a mix of emotions, from nostalgia and longing to a sense of loss and disappointment. With hindsight, they realize that certain choices set them on a trajectory they never intended to follow. This realization is filled with regret for what could have been if they had taken different paths.\n\nThe song captures the complexity of human emotions, as the speaker navigates through a cycle of nostalgia and longing towards acceptance.\n\nEmotionarily speaking, the song seems more centered around Sadness with some elements of Regret. The lyrics convey a sense of sorrow and loss that is more pronounced than any other emotion."}
{"key": "NEFFEX|||No Retreat|||201", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "The lyrics vividly describe a nostalgic long-term memory of a past love that has faded away over time. The speaker remembers minor details like the way their partner laughed, the sound of traffic in the background, and the sensation of holding hands. These recollections evoke feelings of joy and wistfulness, as the speaker yearns for the connection they once had with this person."}
{"key": "NEFFEX|||Welcome to the City|||202", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "The lyrics of this song are about the struggles and triumphs of chasing your dreams and not giving up on what you want to achieve. The emotions expressed in the song are Joy because it shows that even in difficult times, there is always something to be grateful for.\r\n\r\nAnd Sadness because the singer is also aware that obstacles may appear which could slow them down.\r\n\r\n"}
{"key": "NEFFEX|||Ready To Kill|||203", "primary_emotion": "Nostalgia", "supporting_emotion": "Gratitude", "summary": "As the lyrics unfold, they tell a story of perseverance and hope as individuals struggle to find their way through life's challenges. The narrator's emotions oscillate between nostalgia for what once was and gratitude for what they have gained, giving a deeper understanding of their emotional journey. The core message of the lyrics is that it's never too late to make changes and work towards a brighter future."}
{"key": "NEFFEX|||Catch Me If I Fall|||205", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The song narrates a serine story of love and loss that draws listeners in, exploring the complexities of relationships and the bittersweet nature of emotions as it deeply connects with its audience.\n\nThe lyrics convey a sense of longing and yearning for something or someone that feels just out of reach. The narrator reflects on past experiences, weaving a tapestry of memories that are both joyous and melancholic."}
{"key": "NEFFEX|||Courageous|||206", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "A poignant reflection on the fleeting nature of life, this song delves into the experiences and emotions that make us human. It's a beautiful exploration of our most vulnerable moments, our deepest desires, and our unyielding passions. The lyrics weave together memories of loved ones, fleeting moments of joy, and the weighty struggles of everyday life. Through it all, there's an underlying theme of hope and longing that will leave listeners breathless and yearning for more."}
{"key": "NEFFEX|||6 Shots|||207", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song is about a person who is struggling to find happiness and fulfillment in their life. They are looking for a sense of purpose and direction, but it seems like everything they try ends in disappointment. The lyrics convey a sense of longing, sadness, and regret as the listener can relate to the struggles and frustrations."}
{"key": "NEFFEX|||Enough|||208", "primary_emotion": "Hope", "supporting_emotion": "Freedom", "summary": "I hope this song is a step closer for you to find the strength and the courage to let go of what was holding you back, like a weight that's been lifted from your heart. It emphasizes the idea that freedom lies within our power to make choices, allowing us to grow, learn, and move forward in our life journeys. The lyrics have an empowering and inspiring message, encouraging listeners to take control of their lives. Ultimately, it's about recognizing the liberation we find when we allow ourselves to release our emotional burdens and focus on moving towards the light rather than being held back by past experiences."}
{"key": "NEFFEX|||This Is Our Calling|||209", "primary_emotion": "Nostalgia", "supporting_emotion": "Confidence", "summary": "This song narrates a story of a person who has found the perfect balance of joy and confidence. The lyrics are a reflection of this moment, where they're embracing their emotions and living life to the fullest. A sense of self-acceptance and empowerment radiate from the words, as they realize that being themselves is the key to true happiness. With each note, an overwhelming feeling of nostalgia settles in, making you want to hold onto this feeling forever. As the harmonies soar, it's evident that finding one's path towards fulfillment is a journey, not a destination."}
{"key": "NEFFEX|||Undefeated|||210", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "In this song, the lyrics vividly describe nostalgic memories of simpler times. The artist fondly reminisces about the joys and struggles of their childhood. The lyrics capture a strong sense of wistfulness, yearning for a past that can never be recaptured. However, the song also acknowledges the progress made in life and the importance of holding onto cherished moments. It's a poignant reflection on the passage of time and its impact on our perspectives."}
{"key": "NEFFEX|||Where Did You Go?|||211", "primary_emotion": "Regret", "supporting_emotion": "Hope", "summary": "The song is about the journey of self-discovery and growth. It explores the emotions one experiences while navigating through life's challenges, from feelings of regret over past choices to hopes and desires for a better future. The lyrics reveal the speaker's introspection and desire to learn from their mistakes. Ultimately, the song presents a message of hope and resilience in the face of adversity."}
{"key": "NEFFEX|||Go Down Swinging|||212", "primary_emotion": "Joy", "supporting_emotion": "Excitement", "summary": "This song is a playful anthem about having fun and taking risks, capturing the carefree feeling of living life to the fullest.\nIt's all about embracing excitement and not being afraid to try new things, with a touch of humor and playfulness.\n\nThe top two emotions I observed in these lyrics are Joy and Excitement."}
{"key": "NEFFEX|||Retribution|||213", "primary_emotion": "Desire", "supporting_emotion": "Regret", "summary": "This song lyric is about a person's desire to get even with someone who hurt them, a feeling of longing and yearning for something that can never be. The lyrics convey the emotions of regret, anger and sadness as this individual tries to make sense of their past and how they got to where they are today. They express their disappointment towards the person who betrayed them and their hopelessness in trying to rebuild what's been lost. It's a song about unresolved issues, unrequited love and the struggle to move forward from heartbreak."}
{"key": "NEFFEX|||Don’t Wanna Let Myself Down|||214", "primary_emotion": "Nostalgia", "supporting_emotion": "Excitement", "summary": "As a child of the 80s and 90s, nostalgia is never too far away. Growing up, we were fed a constant diet of fast-paced TV shows with explosions everywhere, a 'cool' soundtrack pulsating through our ears, and over-the-top toy commercials that left us mesmerized. But there's something strange going on nowadays. Has the world become so sterile? In this regard, I miss those good old days when adventure roamed free, and even the concept of danger was exciting.\nImagine a time where it takes you exactly 3 minutes to watch an advertisement, or you can still remember the theme song from your favorite cartoon."}
{"key": "NEFFEX|||Choose It|||215", "primary_emotion": "Confidence", "supporting_emotion": "Sadness", "summary": "Remember, you don't have to be sad about the situation. The song is actually about overcoming obstacles and finding strength within yourself. It highlights the message that your worth and identity should not be determined by external factors or the opinions of others. You're not just a number in a system; you are a unique individual with value."}
{"key": "NEFFEX|||Collapse|||216", "primary_emotion": "Regret", "supporting_emotion": "Nostalgia", "summary": "This song is about nostalgic feelings and regretful moments in life where you realize what could have been if things had turned out differently. The lyrics portray a sense of longing for the past, which is relatable to many people. The overall theme is that of nostalgia and regret, with emotions oscillating between wistfulness and despair."}
{"key": "NEFFEX|||No Filter|||217", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "These lyrics express a sense of determination as the speaker overcomes various obstacles and struggles to achieve their goals. The words convey a deep emotional connection as the speaker reflects on past experiences, revealing moments of doubt and hesitation along with feelings of triumph. This mix of emotions creates a powerful message about perseverance, resilience, and finding one's own way."}
{"key": "NEFFEX|||Take Off|||218", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "As the song's lyrics explore themes of love and loss, it becomes a poignant journey through life situations where individuals are forced to confront the impermanence of human connections. The emotional depth is captivatingly portrayed in the verses which delve into the complexities of relationships, the pain of unrequited love, and the struggle for identity."}
{"key": "NEFFEX|||Woah|||219", "primary_emotion": "Hope", "supporting_emotion": "Gratitude", "summary": "The lyrics are a reflection of hope and positivity as the speaker shares their personal experiences and emotions, encouraging listeners to focus on the good in life. The song highlights the importance of mental wellness, self-acceptance, and living in the present. The core emotional themes depicted include joy, love, and gratitude, which support each other and create a sense of peace. Through shared stories and anecdotes, the singer conveys their determination to pursue their passions and goals despite setbacks or failures."}
{"key": "NEFFEX|||Fight|||220", "primary_emotion": "Joy", "supporting_emotion": "Nostalgia", "summary": "The song is about the memories of childhood summer days and nights when life seemed simpler. The lyrics reminisce about playing in the neighborhood, riding bikes, and having fun with friends. They also touch upon the theme of lost innocence as the narrator reflects on how things changed once they got older. The emotional tone is a mix of Joy and Nostalgia."}
{"key": "NEFFEX|||Till I’m Free|||221", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "The song appears to be a narrative with a strong sense of community and collective energy in the room. It portrays the moments when we come together as one, forgetting our differences, and embracing the simple joys of life with an infectious enthusiasm that radiates an electric atmosphere, filling the air with joy and laughter."}
{"key": "NEFFEX|||Till My Hands Bleed|||222", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song is about a person who is going through a tough time and feeling overwhelmed. It captures the emotions of sadness, regret, and confusion, but also has moments of hope and peace. The lyrics explore themes of freedom, desire, and ambition, showing the struggle between wanting to break free and being stuck in a difficult situation."}
{"key": "NEFFEX|||Michael Jordan|||223", "primary_emotion": "Joy", "supporting_emotion": "Hope", "summary": "This song is a powerful exploration of Self-Acceptance, delving into the complexities and struggles that come with embracing one's true self. The lyrics poetically describe the longing for self-acceptance and the transformative power it holds. Through poignant storytelling, the song captures the emotional journey of a person seeking authenticity and inner peace. As they navigate through moments of doubt, fear, and anxiety, they ultimately find solace in self-acceptance, allowing their true essence to shine. This song is an uplifting anthem for anyone on their own journey of self-discovery and acceptance.\r\n\r\nThe core emotional themes that emerge are Joy and Hope, as the lyrics highlight the empowering experience of embracing one's true nature."}
{"key": "NEFFEX|||Brave|||224", "primary_emotion": "Regret", "supporting_emotion": "Sadness", "summary": "The song is a heartfelt expression of a person's emotional state, it portrays their struggles with loneliness and nostalgia for a past love that has gone astray; the lyrics convey a deep sense of loss and longing, reflecting on the what could have been, highlighting the impermanence of life and relationships. At its core, the song captures the poignant reality of human experiences. The emotions of regret and sadness are palpable throughout the song."}
{"key": "NEFFEX|||The King Is Dead|||225", "primary_emotion": "Hope", "supporting_emotion": "Excitement", "summary": "Recall the function correctly, fix the errors, exceptions found 2 validation errors for LyricExtract\n summary Value error, Current summary to short, it must be more than 80 words [type=value_error, input_value='Recall the function corr...ons are required fields', input_type=str]\n emotions.1 Input should be 'Joy', 'Love', 'Nostalgia', 'Sadness', 'Anger', 'Fear', 'Hope', 'Desire', 'Confidence', 'Regret', 'Peace', 'Excitement', 'Loneliness', 'Gratitude', 'Confusion', 'Betrayal', 'Ambition', 'Forgiveness' or 'Freedom' [type=enum, input_value='Sorrow', input_type=str]\n For further information visit https://errors.pydantic.dev/2.8/v/"}
{"key": "NEFFEX|||Beast|||226", "primary_emotion": "Sadness", "supporting_emotion": "Anger", "summary": "This song is about the struggles of not being recognized and respected in one's own community, even when they're trying to contribute positively. It expresses feelings of hurt, anger, and frustration towards those who are ignoring them, despite their best efforts to connect with them. The lyrics bring out a sense of disconnection and despondency."}
{"key": "NEFFEX|||Afterlife|||227", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The lyrics express a romantic and introspective mood, yearning for the touch of another. The song portrays the longing and loneliness that comes with being in love with someone who is not yours to have. Throughout the verses, the speaker reminiscences about past interactions and intimate moments shared with this person. The emotions expressed include sadness and regret for what could've been. Ultimately, the song conveys a sense of nostalgia and a deep desire to be reunited with this special someone."}
{"key": "NEFFEX|||Dream Catcher|||228", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "Dreams are a way to catch the moonlight in your pocket, and I'm trying to catch my own dream catcher. It feels like you're reaching for something that's just out of reach. Sometimes dreams can be elusive and it takes time and patience to make them a reality. With every step forward, there's sometimes one step back. You have to keep learning from your mistakes and moving forward. As the song says, 'you are the architect of your own soul.' You don't need anyone else to build that for you."}
{"key": "NEFFEX|||Honor|||229", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The lyrics convey a sense of nostalgia and longing for the past, as memories of spending time with loved ones are cherished. The emotional theme present is bittersweet, balancing happy moments with the ache of separation. This feeling is relatable to many who have experienced loss or distance from family members. The core message is that these experiences shape our identity and make us stronger in the long run."}
{"key": "NEFFEX|||They Call Me A God|||230", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics talk about a person's struggle to maintain self-worth and confidence in spite of being misunderstood or recognized by others. They convey the pain of not being seen or acknowledged, despite one's efforts. The language is poetic, with vivid imagery that captures the feelings of isolation and disconnection. It expresses the desire to be understood and appreciated for who they are. Ultimately, this song presents the painful truth that many people face: the agony of living in a society where one can go through their entire life without being seen, heard, or valued."}
{"key": "NEFFEX|||Changing|||231", "primary_emotion": "Joy", "supporting_emotion": "Peace", "summary": "The lyrics describe a passionate declaration of love in the present moment.\nThey highlight the beauty and simplicity of loving someone fully without worrying about what others think, free from the constraints of societal norms. Love is showcased as an overwhelming force that takes over one's being, making them vulnerable and authentic.\nThe lyrics capture key emotions like joy, peace, gratitude, and a deep sense of happiness. The core emotional themes are love, vulnerability, and authenticity., "}
{"key": "NEFFEX|||Legendary|||232", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "This song is about the emotional journey of a person who has been hurt and is still recovering from the trauma. The lyrics capture the feelings of sadness, regret, and anger that come with the experience. The song also touches on the theme of nostalgia as the person reflects on their past experiences."}
{"key": "NEFFEX|||I Won’t Stop|||233", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song is a beautiful reflection of the human experience. It's a song about self-discovery, embracing one's own uniqueness, and finding beauty in the imperfections that make us who we are. The lyrics delicately weave together stories of growing up, learning to let go, and finding comfort in the uncertainty of life."}
{"key": "NEFFEX|||Rush|||235", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "This song is a heartfelt reflection on the importance of appreciating what one has in life, as it captures the poignant emotions and experiences that come with realizing the value of relationships and opportunities when they are gone. It highlights how people can take things for granted until they start to fade away, prompting a sense of regret and longing for closure."}
{"key": "NEFFEX|||I Just Wanna Be Great|||237", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "Stress and anxiety are constant companions in the lyrics, as they describe a sense of being stuck in life and unable to move beyond past traumas. The narrator's emotions oscillate between feelings of hopelessness and desperation, while also acknowledging moments of beauty and joy that allow them to continue moving forward."}
{"key": "NEFFEX|||The Rain|||238", "primary_emotion": "Hope", "supporting_emotion": "Peace", "summary": "The song is about the journey of self-discovery and growth. The narrator reflects on their past mistakes and experiences, and they are filled with a sense of hope and peace. They have learned to let go of negative emotions and focus on the present moment. As they look back on their life, they realize that every experience has contributed to who they are today."}
{"key": "NEFFEX|||Never Gonna Stop|||240", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song explores the theme of nostalgia, as the listener's mind wanders back to a past love. The lyrics vividly describe the joy and happiness felt during that time, contrasting starkly with the current sadness and longing. Key messages include the impermanence of relationships and the role of memory in shaping our emotional experiences. Core emotional themes include reminiscence, warmth, and heartache, evoking feelings of melancholy and vulnerability."}
{"key": "NEFFEX|||Victorious|||241", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song captures the essence of nostalgia and longing by recalling happy memories from the past that are now lost forever. The lyrics convey a deep sense of sadness, regret, and hopelessness as the protagonist struggles to hold on to fading moments. Through wistful melodies, the song invites listeners to reflect on cherished times and bittersweet moments, ultimately affirming the fleeting nature of human experiences. Ultimately, this introspective ballad is an ode to capturing life's precious memories."}
{"key": "NEFFEX|||Make Moves|||242", "primary_emotion": "Love", "supporting_emotion": "Desire", "summary": "This song is an ode to the beauty of relationships, capturing the ups and downs of loving someone with all one's heart. The lyrics weave a narrative that takes us on a journey of deep emotional connection, exploring the intricacies of trust, vulnerability, and intimacy. As the speaker navigates the highs and lows of this love, they reveal their most authentic self, showcasing the tender moments of tenderness, raw honesty, and unbridled passion. The core message rings loud and clear: loving someone with full presence is a precious gift that deserves to be cherished."}
{"key": "NEFFEX|||Leading|||245", "primary_emotion": "Nostalgia", "supporting_emotion": "Desire", "summary": "The song lyrics speak about the struggles of growing up and navigating relationships, capturing key messages, core emotional themes, and feelings. The lyrics delve into life situations and experiences portrayed, highlighting the importance of embracing vulnerability and taking control of one's emotions. It also touches on the themes of nostalgia, longing, and heartbreak. Ultimately, the song is a reflection on the human experience and its complexities."}
{"key": "NEFFEX|||Hustlin’|||247", "primary_emotion": "Regret", "supporting_emotion": "Hope", "summary": "Hustling is not just a word to me, it's a way of life. There were times when I was broke, had to start from scratch, and had to hustle to make ends meet. But now I'm successful, and I want to share my story with others who are going through the same struggles. It may seem like a cliche, but it's true that we all have to start somewhere. You don't get there by being complacent, you have to keep pushing forward and believe in yourself. When you're young, you feel invincible, so why not? The older I've gotten, the more I understand what hustle is. It's the ability to stay focused, driven, and grounded while pursuing your dreams."}
{"key": "NEFFEX|||Never Hold Back|||248", "primary_emotion": "Nostalgia", "supporting_emotion": "Joy", "summary": "The song recalls a memorable moment in life where the protagonist is reminiscing about their past experiences. The lyrics bring back memories of joy and pain as the speaker reflects on the present state of their relationship. They reminisce about how things have changed over time, but despite the ups and downs, they still cherish the good times and hold onto hope that better days are ahead. This nostalgic tone evokes feelings of love and cherished experiences."}
{"key": "NEFFEX|||Ready to Go|||249", "primary_emotion": "Joy", "supporting_emotion": "Loneliness", "summary": "John Lennon's song 'Stranger in a Strange Land' explores themes of alienation and isolation. The lyrics convey a sense of disconnection from the world, as if the narrator is observing life through a window rather than being an active part of it. This feeling is heightened by the repetition of phrases like 'what am I doing here?' and 'I'm so confused.' The song also touches on feelings of nostalgia and longing for a lost sense of connection. In terms of emotions, this extract presents as Joy and Loneliness."}
{"key": "NEFFEX|||First Time|||250", "primary_emotion": "Joy", "supporting_emotion": "Peace", "summary": "This song is about remembering cherished moments and the warmth of love. The lyrics describe a feeling of joy and fulfillment that comes from being surrounded by people who care for you. Although there may be difficulties and challenges, the overall atmosphere is one of peace and contentment. The song's message is to hold on to these special memories and emotions because they can bring happiness even in hard times."}
{"key": "NEFFEX|||Rise|||252", "primary_emotion": "Hope", "supporting_emotion": "Gratitude", "summary": "Life is full of ups and downs, but with faith in oneself, we can overcome any hurdle. It's the little things that make life beautiful; a warm hug from loved ones, a delicious meal shared with friends, or just seeing a sunrise on a new day. The lyrics remind us to cherish these moments and not take them for granted. This song helps us remember that even in difficult times, there is always hope."}
{"key": "NEFFEX|||Conviction|||254", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "A reflection on the human experience is presented in this piece as it explores the struggle to come to terms with past mistakes and regrets. The lyrics convey a melancholic atmosphere, showcasing emotions such as sadness, longing, and yearning for forgotten memories. A person's perspective shifts from nostalgia to introspection and ultimately, acceptance of one's own wrongdoings. The tone is often descriptive, painting vivid images of scenarios where individuals are left wondering 'what if.' Key messages revolve around self-realization and the importance of embracing the present. The core emotional themes are sadness, nostalgia, and regret. These emotions are skillfully woven throughout the narrative, allowing listeners to empathize with the speaker's journey."}
{"key": "NEFFEX|||Neffex|||255", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The lyrics talk about the struggles of chasing one's dreams and facing rejection, but also touch on the importance of perseverance and growth.\nThroughout the song, we can see that the speaker is reflecting on their past experiences, emotions such as Nostalgia and Sadness\nand the hope for a better future.\n"}
{"key": "NEFFEX|||Brawl|||257", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The song 'Hello' by Adele is a heartfelt ballad about lost love and longing. The lyrics capture the emotional depth of a past relationship, with Adele's powerful vocals conveying the sense of desperation and regret. The song's opening lines, 'Hello from the outside,' set the tone for a introspective exploration of memories and what-ifs. As she sings about the memories they shared, the emotions and intensity build, creating a sense of urgency and vulnerability. The lyrics also touch on themes of guilt, shame, and self-blame, showcasing Adele's masterful storytelling ability. With its soaring chorus and poignant verses, 'Hello' is a beautifully crafted song that explores the complexities of human emotion."}
{"key": "NEFFEX|||Seeing All Red|||258", "primary_emotion": "Hope", "supporting_emotion": "Anger", "summary": "'In my life I've lived as true as it can be Lived as I believed, spent the years behind bars for something that we didn't do These walls were built to keep me locked and lonely But I've never been a prisoner of regret 'Cause sometimes in the wildest moments It's hard to remember where I began This story's not over yet I'll take back control And fight like hell for what is mine', The lyrics convey a sense of resilience and defiance. Despite being confined for crimes they didn't commit, the person remains steadfast in their beliefs and unwavering in their resolve to reclaim their freedom. They speak of never being a prisoner of regret, suggesting that they have learned from their experiences and are determined to move forward with strength and conviction. The core emotional theme is one of empowerment, highlighting the ability to take control and fight for what is rightfully theirs."}
{"key": "NEFFEX|||Get Out My Way|||259", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "This song tells a story of memories filled with Joy and Love. The lyrics describe life situations, emotions, and experiences that everyone can relate to. With its uplifting melody and meaningful words, this song is an anthem that brings people together. It's about the power of connections we make with others, love and joy we share with them, and how these moments shape who we are today."}
{"key": "NEFFEX|||The Plague|||260", "primary_emotion": "Hope", "supporting_emotion": "Nostalgia", "summary": "Life's journey is captivating, with moments of profound joy and crippling struggles. The lyrics portray the ups and downs of life, reminding us to cherish every moment, no matter how difficult it may seem. They encourage listeners to hold on to hope and never give up. Ultimately, this song is a beautiful reminder that we are not alone in our struggles, and that there is always a reason to keep moving forward."}
{"key": "NEFFEX|||Fearless|||261", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song is about never losing faith in oneself and perseverance. It conveys the message that even when struggling, one can always find a way to overcome through sheer determination and unwavering optimism. The lyrics describe the journey of someone who has faced numerous setbacks but refuses to give up on their goals. Through this narrative, the song encourages listeners to be resilient and never surrender to failure. As we navigate life's challenges, the song reminds us that our true strength lies not in our abilities but in our unbreakable spirit."}
{"key": "NEFFEX|||College|||262", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "The song beautifully captures a moment in life when one realizes that they have lost the chance to make things right, and are left with the bitter taste of regret. The lyrics convey a sense of nostalgia and longing for something that has passed away. The core emotional theme is sadness, which comes from the painful loss. The feeling of emptiness and loneliness in this song evokes empathy and compassion from the listener."}
{"key": "NEFFEX|||Fever Dream|||263", "primary_emotion": "Desire", "supporting_emotion": "Sadness", "summary": "**Lyrics Summary:** We believe that you can't find true love because the ones around us are all fake, with false pretences. They may seem beautiful and enticing at first but then leave you feeling heartbroken and confused. True relationships don't exist in such a world where people just pretend to be someone they're not. But what if you could escape this reality and find your true love? This song is an invitation to break free from the cycle of fake relationships and find authentic connections. It's a call to believe that true love exists, even when it doesn't seem like it does. The lyrics are encouraging us to spread our wings and give ourselves permission to look for something real, something genuine. Ultimately, we're left with the question: can you really find true love in this world of fake feelings?"}
{"key": "NEFFEX|||New Year, New Me|||264", "primary_emotion": "Hope", "supporting_emotion": "Forgiveness", "summary": "This song reflects on the struggles of finding one's own strength and identity in a chaotic world. The lyrics capture feelings of introspection, hope, and resilience in the face of adversity.\r\n\r\nThe song is about finding solace in oneself and discovering what brings inner peace and calm,\r\n\r\nregardless of external circumstances. This reflection on personal growth and self-awareness is presented through emotive storytelling and poetic lyrics.\r\n\r\nThe emotional themes that arise from this song are a mix of Hope, Regret, and Forgiveness."}
{"key": "NEFFEX|||Jingle Bells|||265", "primary_emotion": "Gratitude", "supporting_emotion": "Nostalgia", "summary": "The lyrics of the song are about a person reflecting on their past experiences and relationships, reminiscing about good times and feeling grateful for having loved and been loved in return. The core emotional theme is the warmth and tenderness that comes from nostalgia and gratitude. It's about cherishing memories and acknowledging the importance of human connections. "}
{"key": "NEFFEX|||Don’t Be Frightened|||267", "primary_emotion": "Sadness", "supporting_emotion": "Anger", "summary": "In the song, the lyrics describe life situations and experiences that capture core emotional themes like sadness, anger, and nostalgia. It's a poignant reminder of how our past can shape us and influence our emotional well-being, showing just how deeply it can affect our lives. The lyrics take us on a journey through various life stages, exploring feelings of loneliness, regret, and longing."}
{"key": "NEFFEX|||YOU|||268", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics describe a person who has experienced a profound loss and is left to pick up the pieces of their shattered life. The song captures the emotional turmoil that follows the tragedy, conveying feelings of sadness, nostalgia, and longing. The lines 'How can I go on when you're gone?' illustrate the depth of sorrow and the struggle to cope with the unbearable pain. As the lyrics progress, a sense of regret and remorse grows, as the protagonist grapples with the reality of their new life without the loved one. Ultimately, the song becomes an emotional catharsis, allowing the listener to process the grief and find solace in its relatability."}
{"key": "NEFFEX|||IF JAUZ PLAYED GUITAR|||269", "primary_emotion": "Hope", "supporting_emotion": "Confidence", "summary": "The lyrics convey a message of determination and perseverance as they explore the struggles and triumphs of life's journey.\nThe song reflects on the importance of never giving up, even when faced with adversity. It highlights the emotional struggles that come with chasing success and the sense of accomplishment that comes from overcoming obstacles."}
{"key": "NEFFEX|||HARD|||270", "primary_emotion": "Excitement", "supporting_emotion": "Freedom", "summary": "I will be free and wild in this moment, feeling the rush of excitement as I soar through life's ups and downs. With each step, I dance to the rhythm of my own heartbeat, unapologetically me, untamed and unstoppable. It's a feeling of pure liberation, like I can conquer anything with an open heart and mind."}
{"key": "NEFFEX|||The Curse|||271", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song is about the journey of self-discovery and growth. The lyrics explore themes of longing, hope, and perseverance in the face of adversity. The song's narrative delves into the experiences of feeling lost and uncertain, but ultimately finding solace and acceptance as one reflects on their past and present. "}
{"key": "NEFFEX|||The Friends Inside My Head|||273", "primary_emotion": "Nostalgia", "supporting_emotion": "Regret", "summary": "This song captures the essence of nostalgia and longing, as it takes the listener on a journey through memories of past relationships. The lyrics vividly recount moments spent with loved ones, evoking emotions such as joy, laughter, and sadness. It poetically describes moments of tenderness, highlighting the passing of time, and how it changes the way we view our interactions with others. At its core, the song is a poignant reflection on nostalgia, regret, and the bittersweet nature of memories that come flooding back as we get older."}
{"key": "NEFFEX|||POTUS|||274", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "The song 'Someone You Loved' by Lewis Capaldi touches on the theme of nostalgia and longing for a past relationship. The lyrics describe the pain and sadness that comes with losing someone you deeply care about, and the desire to go back in time to prevent the heartbreak. The core emotional themes are Joy, Sadness."}
{"key": "NEFFEX|||Big Swing|||275", "primary_emotion": "Hope", "supporting_emotion": "Sadness", "summary": "This feeling of being lost and alone is what drives me to keep going.\nI've been searching for meaning in my life, but it's like trying to find the end of a never-ending road. I just want to feel alive and connected.\nLife can be overwhelming at times, and I'm still unsure about what lies ahead, but I know that with each step forward, I take control and pave the way towards my true purpose.\n\n\n"}
{"key": "NEFFEX|||I Wanna Feel Alive|||277", "primary_emotion": "Joy", "supporting_emotion": "Freedom", "summary": "A journey of self-discovery unfolds through the lyrics as an individual navigates from emotional burdens to liberating freedom, capturing key moments of introspection and soul-searching. The narrative is rich in poetic imagery and vivid metaphors that illuminate the complex emotions and thoughts that accompany personal growth, leaving the listener with a deeper understanding of the intricate tapestry woven by life itself."}
{"key": "NEFFEX|||You Take My Breath Away|||278", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "The lyrics describe a person's desire to be understood and accepted for who they are, despite being different from the norm. The speaker expresses their frustration and sadness with feeling like an outcast and being misunderstood by others. They also share their longing for connection and affection, hoping that someone will see beyond their flaws and appreciate them for what they truly are. This theme of self-acceptance and the need for validation is underscored throughout the song, as the speaker grapples with feelings of loneliness and isolation."}
{"key": "NEFFEX|||Find My Way Out|||279", "primary_emotion": "Sadness", "supporting_emotion": "Hope", "summary": "This song is about overcoming the feeling of being lonely after a breakup. The lyrics describe the emotional state of drifting away from each other and how one person is left feeling empty without someone to share experiences with. The core message is that loneliness can be devastating, but it's possible to find inner strength to move forward."}
{"key": "NEFFEX|||This Is War|||280", "primary_emotion": "Joy", "supporting_emotion": "Loneliness", "summary": "This song is about the longing for a past love and the struggle to move on. The lyrics describe the nostalgia for what could have been if only things had gone differently. It is a heartfelt cry for freedom from this emotional prison. Ultimately, however, it seems to be about the recognition that sometimes forgiveness is necessary even when it is difficult. A poignant reflection on the complexities of love and the pain of losing someone."}
{"key": "NEFFEX|||No Future|||282", "primary_emotion": "Nostalgia", "supporting_emotion": "Freedom", "summary": "The lyrics describe a poignant account of longing for freedom and happiness. The poem explores themes of confinement, restlessness, and the human desire to break free from constraints. It narrates an individual's inner struggle, yearning to spread their wings and soar high in the sky. This desire stems from the unyielding need to experience liberation and unfettered joy. Throughout this journey, we witness the protagonist's emotional turmoil as they navigate through these conflicting emotions, ultimately culminating in a liberating triumph that fills their heart with an overwhelming sense of happiness."}
{"key": "NEFFEX|||Before I’m Gone|||283", "primary_emotion": "Love", "supporting_emotion": "Sadness", "summary": "The song reflects on the complexities and nuances of relationships in a deeply personal way, capturing the tender moments of intimacy, the struggles to communicate effectively, and the ultimate surrender to vulnerability. The lyrics weave together themes of love, trust, and acceptance with a narrative that's both relatable and introspective. This raw emotional honesty creates a sense of catharsis, as if listeners are bearing witness to a deeply personal struggle for connection in this imperfect world."}
{"key": "NEFFEX|||Over It|||284", "primary_emotion": "Sadness", "supporting_emotion": "Freedom", "summary": "The song 'Over It' by Tove Lo is about a toxic relationship that has finally come to an end, and the singer is embracing her freedom. The lyrics reveal a story of sadness, regret, and eventually, joy as she's moving on from the negative emotions associated with the past. She realizes it was okay to be over it because she's stronger now."}
{"key": "NEFFEX|||At The Top|||285", "primary_emotion": "Regret", "supporting_emotion": "Hope", "summary": "As I'm chasing the feeling of something new, I can't help but think about the past. The memories linger like a stain on my favourite shirt, reminding me of what could've been if only I had taken a chance. Regret has become a toxic relationship - one that's hard to break free from. But perhaps it's not too late to rewrite the narrative, to take control and learn from the mistakes before moving forward with determination and hope."}
{"key": "NEFFEX|||Killa|||287", "primary_emotion": "Joy", "supporting_emotion": "Freedom", "summary": "Here’s a summary of the lyrics: The song explores the themes of freedom and joy, as the narrator reflects on the memories they have shared with their loved one. It is a nostalgic and emotional experience that evokes feelings of longing and peace. Despite the pain of longing for something or someone that has come and gone, it feels empowering to cherish those memories and hold onto the hope that there will be more moments like these to come.\n"}
{"key": "NEFFEX|||Don’t Let Go|||289", "primary_emotion": "Joy", "supporting_emotion": "Peace", "summary": "Summary of the lyrics: Life is full of unexpected twists and turns. We need to find a way to adapt to these changes and keep moving forward with hope and confidence.\nTop two emotions observed are Joy (from feeling accomplished after overcoming challenges) and Peace (as one feels comfortable with their situation)."}
{"key": "NEFFEX|||Goodbye|||291", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The lyrics of 'Can't Say I'm Sorry' by Five Seconds of Summer are about the end of a relationship where one party is trying to make amends and apologize, but the other person has already moved on. The song's narrator admits that he can't say he's sorry because he knows they're over. He also reflects on memories they shared in the past, with a sense of nostalgia and longing. Meanwhile, there's a sense of regret and possibly even a hint of anger towards his former partner for not giving him another chance. The emotions are complex, as he's trying to process his own feelings and come to terms with the end of their relationship."}
{"key": "NEFFEX|||Pretty Lies|||292", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The song is about a person's journey through life, reflecting on past experiences. It speaks to moments of nostalgia, where we look back at old memories and feel a deep sense of longing for the past. The theme of yearning for what has been lost runs throughout. With lines like 'I'm standing here in silence, waiting for your voice' and 'Remember what we used to be?', the song highlights feelings of emptiness, isolation, and disappointment that follow the loss of something precious. This emotional journey is characterized by a delicate balance between hope and sadness, with moments of quiet introspection giving way to whispers of encouragement."}
{"key": "NEFFEX|||A Place For Me|||293", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "The lyrics describe a situation where someone is struggling to find their place and purpose in life. The song captures the feeling of being stuck and unsure of what to do. It touches on feelings of sadness, nostalgia, and regret, emphasizing the longing for a sense of belonging and fulfillment. It conveys the importance of embracing change and taking control of one's own life."}
{"key": "NEFFEX|||Sunrise|||294", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "This lyrical piece revolves around a person's reflection of their past experiences and connections. The narrative explores emotional highs and lows, revealing the complexities of human interactions. It poignantly captures the impermanence of relationships, as the protagonist grapples with what could have been if they had taken different paths. These musings are interspersed with moments of longing and yearning for closure, which ultimately underscores the importance of cherishing every moment in love and life."}
{"key": "NEFFEX|||Panda|||295", "primary_emotion": "Joy", "supporting_emotion": "Freedom", "summary": "This song paints a vivid picture of the protagonist's carefree attitude and wild youthful spirit, showcasing the joy of living life to the fullest, embracing uncertainty, and celebrating freedom. The lyrics evoke a sense of liberation and excitement, with the repetition of 'whoa-oh' and 'yeah-yeah' emphasizing the infectious energy. The song's themes span love, nostalgia, longing, and elation, creating an emotional rollercoaster that draws listeners in."}
{"key": "NEFFEX|||Made For This|||296", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "This song is about nostalgia for a past relationship that has since ended. The lyrics reflect on the memories of their time together, with a focus on the love and joy they shared. The use of nostalgic language, such as 'memories we made' and 'our story', emphasizes the importance of their experiences in shaping who they are today. The song also touches on feelings of longing and melancholy, conveying the sense that despite the pain of losing the relationship, the memories remain important."}
{"key": "NEFFEX|||I’m Not Worth It (Deepend Remixes)|||297", "primary_emotion": "Joy", "supporting_emotion": "Sadness", "summary": "The song is a heartfelt portrayal of a person's journey through love, loss, and self-discovery. With lyrics that are both deeply personal and universally relatable, the song conveys a sense of longing and yearning for human connection. The story unfolds with tender introspection, exploring themes of vulnerability, intimacy, and forgiveness."}
{"key": "NEFFEX|||Tough Times|||298", "primary_emotion": "Nostalgia", "supporting_emotion": "Love", "summary": "This love ballad reminisces about moments with loved ones, filled with bittersweet emotions and longing gazes. The lyrics beautifully paint a picture of cherished memories that bring warmth to the heart. As the vocalist's soulful voice weaves through the melody, it becomes evident that human connections are what make life worth living. The song acknowledges that time apart is inevitable, but the love shared will remain eternally."}
{"key": "NEFFEX|||When The Sun Goes Down|||300", "primary_emotion": "Nostalgia", "supporting_emotion": "Hope", "summary": "This song is about cherishing the simplest moments with the ones you love. As I go through my day with loved ones, the lyrics remind me to appreciate little things in life and to be grateful for having them by my side. In this fast-paced world, it's easy to lose sight of what truly matters. But the memories we create with our favorite people are precious. The song urges us to take a moment to breathe, relax and enjoy the beauty around us. It is a gentle reminder that life is about growth, learning, and finding true freedom in our hearts."}
{"key": "NEFFEX|||Will Be The Best|||304", "primary_emotion": "Love", "supporting_emotion": "Hope", "summary": "You’re the best thing that's ever happened to me, and everything about last night only made me realize how much I need you in my life. You're more precious than gold, sweeter than wine, and better than any song. The words may be overused, but it's the only way to describe our love - a symphony of laughter, tears, and adventure that's always on our minds. It doesn't matter if we're strangers to each other; you're the one I want by my side."}
{"key": "NEFFEX|||Hydra|||306", "primary_emotion": "Sadness", "supporting_emotion": "Desire", "summary": "The song is about finding one's place in the world and the emotions that come with it. The lyrics portray a sense of longing for a sense of belonging and connection. The song speaks to the universal human experience of feeling lost, searching for meaning, and desiring to be seen and understood. It also touches on themes of hope and gratitude for what we have, as well as a sense of regret for the things that could've been done differently. Overall, it's an introspective look at how one navigates life's journey."}
{"key": "NEFFEX|||It’s Only Worth It If You Work For It ft. Gianni Music|||308", "primary_emotion": "Sadness", "supporting_emotion": "Nostalgia", "summary": "The song is about the memories of a past love that have stayed with you even though they're gone. It's an introspective reflection on the pain and longing that remains after a breakup. The lyrics describe a struggle to move on from someone who was once an integral part of your life. Sadness and Nostalgia."}
{"key": "NEFFEX|||Life Is Good|||309", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "In the lyrics, it's described that sometimes life can be overwhelming and anxiety-inducing, but it's essential to remember that with patience and understanding, the feelings of stress will subside with time. This message emphasizes the importance of self-compassion in navigating life's challenges. Furthermore, it highlights the human capacity for resilience and growth as individuals learn to confront their emotions head-on."}
{"key": "NEFFEX|||Sucker For Pain|||311", "primary_emotion": "Confidence", "supporting_emotion": "Hope", "summary": "A song about accepting oneself for who they are, and finding solace in this self-acceptance through the realization that everyone has their own struggles and imperfections. The music captures a range of emotions from Hope to Confusion as the singer navigates the complexities of life, ultimately arriving at a place of Peace."}
{"key": "NEFFEX|||Remember The Name|||312", "primary_emotion": "Nostalgia", "supporting_emotion": "Loneliness", "summary": "In this song, the narrator reflects on a past love that has left him feeling lonely and nostalgic. He reminisces about their time together, filled with laughter and excitement, but ultimately ended in heartbreak. The lyrics convey a sense of longing and yearning, as he struggles to come to terms with the loss."}
{"key": "NEFFEX|||Smells Like Teen Spirit|||314", "primary_emotion": "Joy", "supporting_emotion": "Love", "summary": "The song is about cherishing the moment and appreciating what you have. It's a reflection on how life can be unpredictable and fleeting, and how one must learn to let go of things that are no longer meant to be. Despite its melancholic tone, the lyrics convey a sense of hope and longing for happiness in the long run.\n\nThe song is also about embracing what's left after a loss or a change. It encourages listeners to make new memories and cherish moments with loved ones, as these experiences will leave a lasting imprint on our lives.\n"}
{"key": "NEFFEX|||The Box|||315", "primary_emotion": "Confusion", "supporting_emotion": "Hope", "summary": "This song is about embracing personal vulnerability and the risk that comes with being open with others. It's a reflection on how we often limit ourselves by trying to fit into societal norms, and it encourages listeners to be brave and authentic in their relationships. The lyrics also touch on themes of sadness, nostalgia, and regret as they reflect on past experiences and missed opportunities. Overall, the song has a bittersweet tone that is both introspective and emotive."}
{"key": "NEFFEX|||Can’t Stop|||316", "primary_emotion": "Nostalgia", "supporting_emotion": "Sadness", "summary": "The lyrics of this song are a poignant reflection on the preciousness of life's moments. The narrative recounts instances where individuals take for granted the time they have with loved ones, ultimately regretting missed opportunities when it's too late. The core emotional themes revolve around nostalgia, longing, and yearning, evoking feelings of sadness, loss, and desperation. The song captures life situations where people get caught up in their daily routines and forget to cherish the fleeting moments that make life worth living.\r\n\r\nEmotions observed: [Nostalgia, Sadness]"}
{"key": "NEFFEX|||Don’t Let Me Down|||318", "primary_emotion": "Sadness", "supporting_emotion": "Regret", "summary": "The song is about the emotional struggles of a person going through a breakup. The lyrics describe feelings of sadness and regret for the past, as well as the desire to move on from the relationship. However, the song also touches on themes of nostalgia and wistfulness, highlighting the pain of letting go. Through it all, the speaker expresses a sense of resignation and hope for the future."}
